{"text": "It's not safe here. I'm getting fished here. Also I'm getting policed here too. I know my Husband already has found this reddit. I suspect his work has too. They have unlimited resources and they specialize in new tech and the place is a snake pit of Narcs both covert and out and proud narcs. Anyhow, active policing of Fake posters and bots and Jokers would be appreciated. You must understand that some of us don't have a place to go. We literally are living in a social network that is not responsive or is just out right hostile to our agency. It would be nice if we could at least not be harassed here or belittled. Yesterday someone was complaining about their spouse who was clearly exhibiting symptoms of post natal depression or what ever it's called and then the OP complained about his kids, his kids. It was clearly a bait and had nothing to do with narcissistic spouses.", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mybgl5i/"}
{"text": "My narc just recently discarded me an hour after we had lunch with him and my kiddo. Got a text ending a 5 year relationship, after I pushed him out 4 months ago and he hoovered his way back in. He made all kinds of plans and made major purchases last week for the house, but it’s come out that he’s been talking to many many women. He suggested earlier that I close my business and work in his (my business is like out of a Hallmark movie) but I know I couldn’t rely on him and his safety. He called me chaotic and said he wanted a simple life. The guy can’t still and is in constant grow,compete, charm mode 20/7 and I give the balance in this relationship I’m shocked but I also realize I knew too much about who he really was, I didn’t let things slide anymore. My business is rocking and last week I asked if he was cheating. What do you think caused the sudden discard? I feel like he knew the jig was up the past few months and was hoping it wasn’t but had to leave because I knew something was up.", "labels": ["love_bombing_cycle"], "primary_label": "love_bombing_cycle", "label_scores": {"love_bombing_cycle": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/napdjra/"}
{"text": "Just want to thank every one. I’m ok. My Narc is diagnosed and I’ve been in contact with law enforcement and records are being made. He is working on it but he can’t help himself and it gets worse as we get older… together 35 years here. Just trying to make it to the finish line.", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/ngy1x1f/"}
{"text": "My husband says I will have to put up with his shitty attitude until he finally gets “some”. Problem is I don’t want to put out until he at least starts to acknowledge me when I talk to him. I just want some respect. I don’t want to be told that I’m not good enough.. am I in the wrong? Is it my duty to put out even if I don’t to. He says it’s what couples are suppose to do. But that doesn’t sound right to me.", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/nihua3v/"}
{"text": "Yeah, Honestly, My husband's work has unlimited resources and tech and they for sure monitor this site. Not safe at all.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mybjluw/"}
{"text": "Likely my spouse, a very good actor. 😥", "labels": ["communication_breakdown", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/nbg9m8v/"}
{"text": "Hoping my abuser doesn’t come on here. But, it would be just like him to do it. I sure enjoyed watching him with a police escort today, carrying his sorry little bag of belongings from our home.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/nbga2lb/"}
{"text": "Probably my ex. Sorry folks he is a sneaky person and I hope he gets banned from the group quickly.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/nbga88c/"}
{"text": "You’ve nailed it. I was with my ex for 13 years - he love bombed me and I fell hook line and sinker. He made $130k and I make as a medical assistant $65k and that’s before taxes and he had me paying half the rent and bills and we had 5 kids - 3 his and 2 mine and after “my half” was paid I had like maybe $100 for gas for the two weeks and not a lot else. I was completely freaked out about how could I even get out because I can’t even save money to stash away. I lived off credit cards and panic and fear along with a lot of other nonsense - but the money was a huge factor!! I waited til my last kid to go off to college and the next two months was me planning how to leave to go stay with my mom. I am 50 years old and live with my mom because I was literally bankrupted. I am just now starting to get back on my feet and two years later and it’s hell. I live with shame and guilt for having to keep my kids in the same house with that man (their dad was a Disneyland dad - not always available unless he was taking them on vacay) and I am still so reluctant to date because I don’t trust anyone anymore. Like at all. No friends no romantic involvement I thing because I am so traumatized from the abuse and actually needing him for the home and the money because that’s all I had left in me for the three years prior to leaving me. He was a narcissistic alcoholic. Do the math - it’s a bad bad mix of human that I am still reeling from. How does anyone get over that? Do any people here have suggestions for working through this? I loved this person so much at one time and I can’t get over him even though I left for self preservation. Why am I still so affected? Thoughts? Who else has been through the phase of still living the person you hate? And how will I know if this type of person comes into my life again and blows me AGAIN? Is it who I attract? How do I recognize this again?", "labels": ["financial_abuse", "emotional_abuse", "parenting_conflicts", "infidelity_jealousy", "love_bombing_cycle"], "primary_label": "financial_abuse", "label_scores": {"parenting_conflicts": 2, "emotional_abuse": 2, "infidelity_jealousy": 1, "love_bombing_cycle": 1, "financial_abuse": 3}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/njqbc5x/"}
{"text": "Mod, she is right about one thing - it might be good to have one or two more people helping on this sub. I’d be happy to do that if you feel like it’s a good idea.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjo9i8/"}
{"text": "Narcs are so hard for me to identify in real life let alone based on comments on Reddit! I am grateful that after reporting a commenter who I suspected was one, his posts were quickly deleted by a moderator. Maybe instead of banning someone after the first offense, go by the three strikes, you're out rule like baseball?", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/nbwp7zh/"}
{"text": "No.. and fuck that.. she has 5 bfs and he’s told her he wanted a divorce for years.. she’s abusive, I’m not going to atone for my sins, he’s a good person, I’m a good person, We even treat his wife like she’s a good person. You just don’t like ME", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtj7scx/"}
{"text": "Yes, my narc spouse tells me I am gaslighting him, a narc after I told him he was, after getting a pretty good diagnosis on him from a therapist. He deflects all his crap on me and makes me think twice. Everything’s all about him. Anyway, yea- can see this.", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mwnta3c/"}
{"text": "I mean, I wouldn’t like the woman my husband was cheating on me with either. That’s just batty", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtj8h3v/"}
{"text": "I’m not saying she should like me, I’m saying YOU don’t like me because of what I’m doing.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjclwn/"}
{"text": "I never said he said he was a good person… I’m saying that he is", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjc73j/"}
{"text": "You are defensive and projecting a lot of motivations on those conversations that weren’t there. You accused me of starting from a place of judgement, on my first comment, when I wasn’t. I think you know there is something hinky with the situation you are in, but you don’t want to face it because you are afraid you are in the wrong, that your boyfriend is in the wrong, and you are afraid of what that would do to your opinion of yourself and him. It feels good to be with him because you were fresh out of a bad relationship and someone new wanted you. It feels good to be a person that this man says he needs. It feels good to be told you’re a good woman compared to a horrible one. And the sex is also probably pretty good. And you aren’t ready for any possibility that your judgement is clouded, that he might be using you, that he might be lying, because you’d have to give up all those things that feel good and take on a bunch of stuff that doesn’t. Let me tell you - I was the “wife”. I was the “horrible woman” he had to get away from. He had an affair partner who was fresh out of another bad relationship and vulnerable and desperate for something to feel good. He was a liar, monkey-barring from one partner to the next. You can’t help him because he doesn’t need help. EVEN IF it was all as you say - with the consensual open relationship and the horrible wife- it is still *incredibly inappropriate* for him to be bringing you into this drama with his wife. He is not doing well by YOU. He should be seeking support from a THERAPIST to work through his divorce. If he does actually get divorced and you two stay together, he will use his last relationship against you. If you do something he doesn’t like, he will compare you to his ex-wife. How do I know? I was also that person. I supported someone through a divorce - THE SAME MAN who turned around and did the same to me. If it is as you say, if you both really love each other, if his wife really is horrible, if he really is pro", "labels": ["infidelity_jealousy"], "primary_label": "infidelity_jealousy", "label_scores": {"infidelity_jealousy": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjx1np/"}
{"text": "You’re not even having a conversation with me , it sounded like you thought I meant she should like me, and that’s not what I’m saying… Truly… I feel bad for her, she hasn’t had an easy childhood, and I’ve defended her at times when my bf says her mom is pretty cool though, and I said, her mother was absent and terrible and no matter how cool she is that’s not how she feels about her so you should respect those feelings. And I stand by it.. regardless if she’s abusive. She’s a person, and it’s clear she’s erratic and not emotionally stable… But , I still didn’t Like that he minimized her perspective, and I’ll defend her every time in that regard. There are actually types of narcissism and there is complexity to all of it.", "labels": ["communication_breakdown", "parenting_conflicts"], "primary_label": "communication_breakdown", "label_scores": {"parenting_conflicts": 1, "communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjfg59/"}
{"text": "I can totally be on board with him getting therapy.. he’s been to therapy.. he (like me) got out of being an alcoholic. We BOTH were. We BOTH got sober. Separately with therapy. He had reservations about bringing me into it, told me I didn’t have to be a part of it. He also said that he was scared and really wanted support to get out of the situation. He has never brought up divorce with his parents after his dad told him no, she will sue you and take everything… He told his mother about me and that he wants the divorce, no going back, And his mom is in complete support and told his dad it’s happening. My boyfriend is a SENSITIVE human being. He grew up with a lot of fighting in his house and is very sensitive to yelling. It gives him extreme anxiety, And his wife knows and uses this keep him “in line” I feel like you are more projecting your story onto mine… This is not your story.", "labels": ["self_doubt_recovery", "parenting_conflicts"], "primary_label": "self_doubt_recovery", "label_scores": {"parenting_conflicts": 1, "self_doubt_recovery": 3}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjzsew/"}
{"text": "You’ll defend her huh? But make five posts about how awful she is", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjgewj/"}
{"text": "You don’t feel bad enough for her to not fuck her husband behind her back.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjx95b/"}
{"text": "I think I have to mention this… my bfs response to this, was .. you know, you’re right, I do see why she would feel the way she does, and I know it’s been hard for her. … that is… empathy for her.", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjftic/"}
{"text": "My ex was a SENSITIVE human being too, with his own childhood trauma. This is a pattern of behavior that is very familiar to this sub. So yes, it is my story. It’s a story a lot of people here have lived. It’s your story too. You aren’t ready to see it yet. That’s fine. None of us can force you to. I just hope something will stick in the back of your mind so you recognize it eventually. And when you do, we’ll be here to listen like we are for every other person who has lived this story.", "labels": ["communication_breakdown", "self_doubt_recovery"], "primary_label": "communication_breakdown", "label_scores": {"self_doubt_recovery": 1, "communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtk0y09/"}
{"text": "People are complex… yes, she’s abusive, at the same time I can see why certain things for her in childhood would have been traumatic.. and I’m not a person to just ignore that and think differently because she’s abusive. I’ve also pointed out things to my boyfriend about why she is the way she is. And most narcs… Stem from trauma. These can be all kinds of different traumas, And it’s no excuse to them, they aren’t given a pass because they don’t cope with trauma well.. I think what I’m saying is, I don’t think her humanity is completely irrelevant to me. With my step mom either, I just know it won’t change, and stepping away is the best you can do.", "labels": ["self_doubt_recovery", "communication_breakdown"], "primary_label": "self_doubt_recovery", "label_scores": {"self_doubt_recovery": 2, "communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtji0ou/"}
{"text": "Are you not a sensitive human being with trauma 💁‍♀️ see… we all are… including narcs… in fact.. I saw my dad push my step mother out of the way one time.. okay.. he was frustrated as hell, she wouldn’t leave him alone. Did it give him the right, not really, and he pushed her away from him, What she did was throw herself into the wall. My dad did NOT do that.. but, she told everyone he did and the lighter “shove” was real. So, did he physically push her? Yes, Did he push her into a wall with malice and indifference like she said.. NO. These little details, they matter.", "labels": ["parenting_conflicts", "self_doubt_recovery"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 1, "self_doubt_recovery": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtk23w0/"}
{"text": "Nah, that’s not what one of your other comments said. Because she doesn’t KNOW ABOUT YOU", "labels": ["control_and_gaslighting", "communication_breakdown", "emotional_abuse"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtjz8qu/"}
{"text": "This is a straw-man. He can have legitimate trauma and still be a liar and manipulator. Both things can be true.", "labels": ["self_doubt_recovery"], "primary_label": "self_doubt_recovery", "label_scores": {"self_doubt_recovery": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1csn4bh/for_any_opinions_on_the_moderation_or_state_of/mtk2dps/"}
{"text": "Just a vent My husband did something that really embarrassed me and, in my opinion, put us in a awkward position with some of our friends. I wish I could talk to him about my feelings about it like a normal person. I wish I could say, \"I wish you hadn't done that,\" or, \"This thing that you did makes me uncomfortable.\" But of course I can't, because I'll just get screamed at, gaslit, and DARVO'd.", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oif8wc/just_a_vent/"}
{"text": "Yeah...and then in turn you will go all JADE (Justify, Argue, Defend, Explain) Just quietly observe him, and note it. Don't engage, because he's probably waiting for you to do exactly that.", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oif8wc/just_a_vent/nluzlyl/"}
{"text": "He probably did it on purpose to isolate you from your friends. If you can’t leave him, at least leave him at home. Don’t let him take your friends from you - you need that support system.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oif8wc/just_a_vent/nluzpvx/"}
{"text": "If you prompt chat gpt, \"can you please pretend to talk to me and validate me about my feelings and experience as if you were my husband? What happened was xyz\" ChatGPT will give you an answer that will validate you. It will calm that part of your brain itching for closure. We just want to be seen, esp in pain. Pretend and reality cause the same pain in our body but then so does visualizing good stuff creates good feelings. You can also add screenshots of kind convos from your narc and then say \"look at the way my narc husband speaks, can you talk to me using his type of language and style\" and it will feel more realistic It helps me, it's instant validation and alsooooo I told chatgptt to talk as if it's a qualified therapist", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 3}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oif8wc/just_a_vent/nlv0yf6/"}
{"text": "My husband is a DARVO master. I bought a book on how to improve communication in our marriage. I asked him to read it after I had because I thought it would be helpful. He said he would read it at work but then I found that he had just put it on a bookshelf in our home. He didn't read one damned word. He readily admits that he hates to communicate and just doesn't understand why it's necessary. I've been grey-rocking him for several weeks after he did something really hurtful to me and I think he loves it! I'm not going to try to have productive conversations with him anymore. All he does is DARVO which makes me feel worse. I'm sorry that you're going through this, too. Life with a narc sucks.", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oif8wc/just_a_vent/nlwb6zk/"}
{"text": "This happened to me too where he told my mom and step dad private sexual details between us. I was horrified. This was said in front of me. So I denied what he was saying. lol I was totally pissed though when we got home and he couldn’t understand why I was upset.", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oif8wc/just_a_vent/nlwyuc9/"}
{"text": "It made him look bad too! Of course he would never see it that way, because he never does anything wrong. I wish I could apologize to our friends for his blunder, but I'm afraid it will get back to him.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oif8wc/just_a_vent/nlv7bdv/"}
{"text": "One day I saw the word DARVO and didn't know what it meant, so I googled it. When I saw the definition, my jaw dropped because it described what happens basically any time I try to have a conversation with my husband beyond, \"Yes dear, whatever you say dear.\" That was the day I learned my husband might be a narcissist.", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oif8wc/just_a_vent/nlwm9sy/"}
{"text": "Do you ever had good sex? Sex was always bad with my wife. I ignore it, because I was desperate for relationship and she seemed perfect beyond sex. I wonder if bad sex is not a part of the deal. Something was just not good about it since the start. I don't know what. Maybe there is some pattern or something?", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/"}
{"text": "lol that was the only thing he was good at. Sadly, learned through ton of practice. He cheated with over 25 while i was pregnant. Zero idea how many in all 14 years", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nluew2v/"}
{"text": "That was the only thing good in our relationship lol… he was really good at it. But I feel like he used this as a weapon also, like he would only make sure I was satisfied to make me “act right”, if I was standing up to him too much. If that makes sense. In the end tho, even this disappeared. The closer I got to finally being done with him, the more he withheld any affection or intimacy, including sex. Our last year together was crushingly lonely.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nluo14o/"}
{"text": "He was a great lover. And I became addicted to his sex. But I think mainly the addiction came from the fact that we were in a good moment, he was happy and he wanted to be with me and love me. It became like a price for me (mainly emotionally) after chaos. Also he controlled sex, he will not want to be with me to punish me.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlupvgr/"}
{"text": "He's only incredible to me in the bedroom. And he withholds sex. So there's that.", "labels": ["control_and_gaslighting", "communication_breakdown", "emotional_abuse"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlv3kod/"}
{"text": "It was always bad, I never felt the connection! And when I tried to include sex toys, he got jealous of them and made me feel guilty.", "labels": ["infidelity_jealousy"], "primary_label": "infidelity_jealousy", "label_scores": {"infidelity_jealousy": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlunkr8/"}
{"text": "My ex husband is diagnosed as NPD. Sex was always amazing. It's the one thing I miss of our almost thirty year relationship.", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlutol2/"}
{"text": "Mine was shit. We're both women and she essentially did to me what she liked to have done to her. Eventually I got really frustrated with trying to 'show' her (which she repeatedly ignored), said 'I'M NOT YOU!', and explained in simple language that when you have sex, you find the things that make your partner go 'oooh' and then you do those things a lot. She was good at it after that. When I asked her how come she was suddenly able, having *not* been able, she did the narcissist's blank stare. It's pretty clear to me now that the issue was that she hadn't actually considered my being different from her, and the revelation of her error in such a direct way will have made her extremely uncomfortable. It revealed the empty space where her 'giving a shit about my experience' was meant to be. Her sudden improvement was a demonstration that she was basically following a 'format' of a happy relationship, rather than actually engaging with me by understanding me. I didn't see that at the time though.", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlug63e/"}
{"text": "He was all talk and no action . Sex was so mechanical . The only time sex was “good” when he took my virginity and I guess it was good because I loved the idea of having it more than actually enjoying it cause I didn’t know . It later it was so mechanical and I also felt he didn’t wanna do it with me but doing it as a chore . After relationship I did hookup and I had more chemistry with my fwb than I ever had with him in my 6 years of relationship", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nluu6xw/"}
{"text": "I wrote out a whole thing before I realized that this was in narc spouse sub reddit. I can't armchair diagnose or diagnose period but, my husband does have a personality disorder he has been diagnosed with (BPD) which can exist with narcissistic personality disorder. He is abusive in lots of ways. The only good thing about our relationship probably the best thing is the sex. He is someone who gets incredibly turned on by how much I am enjoying myself. Some people are just like that and enjoy giving and pleasuring you. Others not so much. Life is too short for shitty sex.", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlv60o1/"}
{"text": "At first it was ok. I was 24 and fairly inexperienced so I thought that was just it. I couldn't say exactly when but eventually after she would get hers she'd be done and I'd either finish myself or just clean up and not even bother. I stopped having any interest in sex and she weaponized that against me. Calling me impotent, accuse me cheating or being gay or all three. So in order to avoid the names and accusations I contiuned have sex with her when ever she wanted. I felt so stuck, I felt dirty and used all the time and I couldn't say anything because she would let the BS fly if I did. Sexual Manipulation is very real and very harmful.", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlvxaax/"}
{"text": "I think this is one of those variables which isn't consistent across the board. We had great sex 24/7. He was 20y older than me and never had a problem in the bedroom. BUT the moment the mask fully dropped, in combination with finding his porn addiction, I never touched him again. It made me physically sick and I GTFO.", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlw69xp/"}
{"text": "This is actually a tough question but shows how complex this disorder is. My nex wife and I had an amazing sex life- crazy good. I’m wired to physical touch. We literally fed off each other physically. She is a covert and only knows what “to be loved/feel loved” is in regards to love. She had no idea what real love is or how to show it. It’s not uncommon to have this dynamic or the “ sex sucks” dynamic. From what ive learned, it’s often one or the other. Those well versed in psychology, psychiatry and/or neurology can surely add to this. It’s definitely a very complex and extremely fucking destructive disorder. Ooft!", "labels": ["control_and_gaslighting"], "primary_label": "control_and_gaslighting", "label_scores": {"control_and_gaslighting": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlwsygv/"}
{"text": "He was great at first, now not so much. My health problems get in the way of me fully enjoying it, it’s like he always subconscio pushes the open relationship thing and I’m not digging it. Hes a giver but I’m not a taker. Lmao. Like, the last thing I want is bottom of the barrel BS other dudes. Especially with my health problems like I know I’m not desirable. Lmao.", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlvp14f/"}
{"text": "Mine was not; because he always insisted on getting up and going back to his computer the second he was done. It’s also hard for me to answer because I can’t separate it from the way he would treat me at times; like if you’re yelling and cursing at me because I didn’t park on the exact parking spot you told me to at the restaurant, I’m just not gonna enjoy it later.", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlw9hq4/"}
{"text": "Its always when and what her ways for her! Extremely sensitive as well. But she was good at blaming me for not initiating forgetting or ignoring her rejections for any touch or affection.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlwq63q/"}
{"text": "What do you mean always bad with your wife? Like is she a dead fish or what?", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlvsdc6/"}
{"text": "Sex was bad until she cheated with me on the guy she left me for, lol. Literally the only time she was into it, otherwise it was like fucking a music video. Nice to look at but ultimately empty & hollow.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlwno7m/"}
{"text": "No. He has always just laid there starfish style. For awhile I gave him the benefit of the doubt because he was a virgin when we met. Then I realized he was just lazy in bed.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlxb2m4/"}
{"text": "Married 38 years. Sex was just ok. I had some health issues (cancer) it left me with internal damage. Sex was painful. 10 years later he was very sick and in a coma. Not expected to survive. Something happened. It’s not crazy all the time sex. Still can’t enter all the way but wow such a crazy improvement.", "labels": ["control_and_gaslighting"], "primary_label": "control_and_gaslighting", "label_scores": {"control_and_gaslighting": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlx8vmv/"}
{"text": "I’m also in a lesbian relationship, and it’s not exactly the same dynamic you describe, but my wife is 100% selfish in bed. If I don’t have an orgasm within 3-4 minutes she will start saying she’s losing stamina, ask what I need, tell me to communicate, etc. She’s not very good at all, kind of a one trick pony, which has been surprising given how many partners she had before me. Quantity ≠ quality I guess. Occasionally I do manage to finish within 5 minutes, and if not I usually just fake it, and then that’s all I get. I feel like the stereotype with lesbians is we can have long sessions because there’s no penis that’s going to deflate, but she never continues to a round 2 for me or even (sorry to be explicit) stays in long enough for me to ride out a full orgasm. Meanwhile, I am very generous in bed, and I’d never claim to be perfect or some kind of sex goddess but I know I satisfy her when we have sex. Which is almost never these days. She likes to criticize me for not initiating enough, then criticize the ways I choose to go about initiating, then say no when I do exactly what she said she wanted. I’m not even attracted to her now so I just don’t bother anymore. There is sooo much I could say on this topic, it’s actually insane.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlujk9g/"}
{"text": "My ex & I had sex AT LEAST 3 times a day. She never enjoyed it but she always wanted it. Then she left me for a guy who was addicted to porn & never fucked her at all :)", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlwpiqg/"}
{"text": "I filed divorce at 10 weeks postpartum when I found out. It's still crazy to me because the people he cheated with were double my age, double my weight, some literally developmentally delayed. It was crazy to throw out a wife and 2 kids for someone he wouldn't be caught dead with in public.", "labels": ["control_and_gaslighting", "parenting_conflicts"], "primary_label": "control_and_gaslighting", "label_scores": {"parenting_conflicts": 1, "control_and_gaslighting": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlvi4dm/"}
{"text": "I loved when he acted like he did such a great job. Sir, get out so I can handle myself *eyeroll*", "labels": ["financial_abuse"], "primary_label": "financial_abuse", "label_scores": {"financial_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nluhv8i/"}
{"text": "I too thought that he might be inexperienced and since he always says I’m his first (which I highly doubt now ) it was awkward weird", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nluujm5/"}
{"text": "Yes! I was wondering this myself yesterday when my husband was just staring at me when we watched a movie with our oldest son. It made me uncomfortable, even our son noticed....", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlvijoc/"}
{"text": "Sounds like she's not a one trick pony, it's just a different goal; she's got tonnes of tricks in the 'how to stop someone wanting to have sex with you' category! Yes, there's lots to say; it's not really the kind of thing that gets talked about much in real life. I'm not sure I've ever said what I said in my post out loud.", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlulafk/"}
{"text": "They always cheat with someone who isn't their type. Mine said he would never be interested in one race and then proceeded to cheat with a woman of that exact race. I think they just take whoever they can trick into falling for their BS.", "labels": ["infidelity_jealousy"], "primary_label": "infidelity_jealousy", "label_scores": {"infidelity_jealousy": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oic1kt/do_you_ever_had_good_sex/nlxbfaa/"}
{"text": "He called me abusive My partner called me abusive. He said I was psychologically abusing him. I have reached the point in my life where I am questioning reality. He was talking to my child and I thought he was getting angry. I forget what word I said but I said something about him sounding angry. He’s told me in the past not to assume his emotions and not to make him out to be angry. I think his tone had changed. He was asking my kid about what she ate for lunch and how much she ate. It sounded angry and interrogating to me but maybe I’m just wrong? Then after she left he started to yell at me. Told me I was abusive and was making it out to my kid that he was an angry person. In reality I just noticed her discomfort and wanted to point out that he sounded angry so he could I guess assure her he wasn’t. I have no idea what was going through my mind. I should know better. But he said I was setting him up and making my kid see him as angry and that I’m abusing him. He also told me that I don’t have superpowers and can’t know what others are thinking. I know I don’t have superpowers and can’t read minds but I can pick up on cues that my kid is uncomfortable. I can hear someone’s tone change and I can interpret that as anger. I just feel crazy. I don’t know what’s real or not at this point. I was abused in a previous relationship (many many years ago) and I worry I’m just crazy because of it. Maybe my anxiety is causing me to not understand what’s going on around me. I just don’t know. I don’t think I am abusive. I know I never intend to be. I know I am not trying to make my kid see him as angry. I am not trying to do anything bad. I just feel so defeated right now. Maybe I am the problem? edit: Thank you for all the responses. I am sad to know so many people have gone through the same thing I am going through but I appreciate the support so much. I know I am not abusive but I just needed to work through these feelings with a bit of help. I plan on seeking therapy soon b", "labels": ["control_and_gaslighting", "emotional_abuse", "parenting_conflicts", "self_doubt_recovery"], "primary_label": "control_and_gaslighting", "label_scores": {"parenting_conflicts": 1, "emotional_abuse": 2, "self_doubt_recovery": 1, "control_and_gaslighting": 2}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/"}
{"text": "He is gaslighting you. He has succeeded in making you question your own sanity. Why are you with him? Is he the father of your child? This will continue as long as you are with him. Narcissists rarely change.", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlum9sa/"}
{"text": "Ugh I have seen all this before. Acts angry - you ask why they’re angry - and he gets mad at you for “assuming” his emotions when he is very obviously angry. Then he’s raging and yelling at you for asking why he’s angry. He is very obviously emotionally abusive - him calling you abusive is projection in his part, because he knows that’s what he’s doing. He’s doing this on purpose to put you off balance, avoid accountability for his behaviour, and to put you in line making you feel like it’s your fault so you’ll shrink yourself and allow him more control. You need to stop expecting him to react rationally. He’s making you feel crazy on purpose.", "labels": ["control_and_gaslighting"], "primary_label": "control_and_gaslighting", "label_scores": {"control_and_gaslighting": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlunop0/"}
{"text": "You feel crazy because he’s making you that way. Trust your instincts—they know the truth. I went through the same thing. It got so bad that I got myself into therapy just to make sure that I wasn’t losing my damn mind.", "labels": ["control_and_gaslighting", "infidelity_jealousy", "self_doubt_recovery"], "primary_label": "control_and_gaslighting", "label_scores": {"self_doubt_recovery": 1, "control_and_gaslighting": 1, "infidelity_jealousy": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nluulak/"}
{"text": "I feel like I could have written this post. It’s been a year since we stopped living together, and I’m so glad that I don’t need to intervene with his anger and actions toward our kids anymore and then get called abusive and undermining his role as a father for intervening. It makes me sad that it took so much time away from him to realize just how bad it was while we were in the thick of it. Hugs to you, OP.", "labels": ["parenting_conflicts", "emotional_abuse"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 2, "emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlunnf2/"}
{"text": "Anytime you see your narc in a negative light or frame their actions in a negative way they feel abused, but that's not what abuse it. And no we can't know what others are thinking, but he can judge their behavior, tone, energy and actions as meaning something, and if they don't want their behavior judged they should align it with their innocent sweet thoughts.", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlup7c2/"}
{"text": "Omg hahahah dude I swear to god they are all the same hahahah I’m sorry I’m not laughing at you. I think this is INSANE!!!! Hahahahahah my ex was the same way!!!! He said I was psychologically abusing him omg ima take a big fat dump on his grave.", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nluopga/"}
{"text": "Sound like him not taking accountability about his non verbal language and being defensive over it. Sorry you are going through that, you deserve better. Leave his ass, in the long term your baby will be better off and even more importantly safe!", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nluumf4/"}
{"text": "Mine calls me abusive any time I disagree with him. It's been weaponized, and I think part of the point is to \"take the sting\" out because by defining any little disagreement or annoyance as abuse, it puts actual abuse on the same level (in his head). You're not abusive. They are.", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlv1ds8/"}
{"text": "Yes, this accurately describes my husband (and I am only now identifying it!) I was using AI earlier today to help better identify and sort out the cycle, because I am sick of it!! Maybe this helps you. I believe mine is best described by the description of a covert passive aggressive narcissist. From my AI search earlier today: Sometimes control isn't through obvious outbursts or domination — it is through *emotional destabilization*. The goal (often unconscious) is to keep you doubting your reality and dependent on their reactions. The cycle you’re feeling daily often follows this loop: 1. **Subtle Devaluation:** Small, hard-to-prove behaviors — dismissive tone, withholding warmth, “forgetting” things important to you, vague criticism hidden in concern. 2. **Emotional Ambiguity:** You sense something’s off, but there’s no clear event to point to. Your brain can’t resolve the contradiction (“Did that really just happen?”), so it stays *alert*. 3. **Panic / Hypervigilance:** Because you can’t predict what’s coming or explain what’s happening, your body stays in fight-or-flight mode. The anxiety feels constant. 4. **Temporary Reassurance:** They may suddenly act kind or apologetic, giving relief. This intermittent kindness “resets” the cycle and keeps you hoping things will settle. 5. **Renewed Undermining:** Once you relax, the subtle digs or distance resume — and the panic returns. That loop trains your nervous system to scan for danger even when nothing overt is happening.", "labels": ["communication_breakdown", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {"control_and_gaslighting": 1, "communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlv5rw8/"}
{"text": "Anything a true narcissist accuses you of is something they're doing themselves. So he's actually admitted to being abusive whether he realises it or not.", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlw7w65/"}
{"text": "Miss Ma’am, if you were the problem you wouldn’t be here looking for solutions! lol You ARE NOT the problem and you KNOW that. Just because he succeeded in making you briefly forget it, doesn’t mean you deep down don’t know you’re NOT the problem. They’re liars, deceivers, manipulators, gaslighters, controlling and they lack emotional intelligence and EQ on a level surpassing anyone else (other than the psychopath and sociopath). Either way, you’re not the problem and I really hope you can get out. There is a light at the end of the tunnel", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlv986d/"}
{"text": "I see a few things here that my nex did!! Yucky. The first: being clearly angry and insisting “I am not angry”. In the beginning, she would occasionally admit to feeling anger if I was really putting my foot down; admitting to getting angry when she drives after an episode of road rage, for instance. Then the “I’m not angry I’m just (anxious/frustrated/sad)”; then no negative emotions at all, but rather “I’m not angry I’m just *bad at communicating*.” Less and less accountability as she pushed harder and harder, until we finally landed on “I am not angry because I am never angry because I don’t feel anger and I never have.” Sometimes shouted, angrily. It would leave me sitting there thinking, what about the times before, when you described your own feelings as anger? Those never happened? The second: “you can’t know how I feel so you can’t say I’m angry!!” My go-to example experience with this one is- During the discard phase, my nex was experimenting with physical aggression. At one point, she kicked some kitchen appliances that were being moved out and made a huge mess. When asked not to kick things: “You’re making a lot of assumptions!!” Because watching her kick something in the middle of a tantrum and recognizing it as a tantrum involved an “assumption” wrt her feelings, as if angry kicking isn’t easy to recognize and understand. And, 3. “No, YOU’RE abusive!!” This started for me when I started naming her behaviors that hurt me and telling her what needed to change. I NEVER used the word “abuse” to her because I knew it would set her off; I talked around it, used words like “scared”, “hurt”, etc. She started her rebuttals with “your behaviors towards me are abusive”, and eventually started telling people she’d “described me to an abuse hotline” and they said I was abusive, that I was getting other people to abuse her, etc. All of that to say, it sounds like your N is following a pretty standard N script complete with out-of-pocket anger and gaslighting, which l", "labels": ["emotional_abuse", "love_bombing_cycle"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 9, "love_bombing_cycle": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlvgmrt/"}
{"text": "If nobody has said this yet, their accusations are often self confession. I know it’s very disorienting and confusing. It’s intended to be. You’re not doing anything wrong. Unless you’re not making a plan to leave. My teenager recently told me her dad said his girlfriend is abusive. It is 100% him. Same story, different dude.", "labels": ["control_and_gaslighting", "communication_breakdown", "emotional_abuse"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlw8tlz/"}
{"text": "I’m so sorry. I had been knocking on crazy’s front door for decades. I read this and heard my own voice when I said these same words to myself. Maybe I am crazy? ‘Everyone’ is telling me I’m the problem. Everyone is me 58f, stbx 62m and two of our children, 34m and 30f. Everyone. I had always told myself it’s all my fault. I completely discounted my friends telling me it’s not me, because they didn’t know me like he did. Spoiler: my friends were right. Our adult children only remember my reactions to him, but they didn’t see the covert abuse that pushed me so far. Because I protected him. I stabilized his wild emotions and gave him a veneer of humanity. Oh Daddy just gets upset. You know how daddy gets. Let’s get this done before daddy gets home or he’ll be mad. We lived in fear of him. Now those three firmly believe I am crazy and abusive. 28f keeps out of it. When I ran from the house five months ago (barefoot, braless, in the rain 🙄) I told the police he didn’t mean to harm me or bruise me. No he’s never hurt me directly. I’m just a ginger whose skin is easy to mark. I got a temporary restraining order, but I could not extend it because I had *repeatedly told police I was in no physical danger. I ran because he was going to bash my head with my phone. I was in danger, yet I protected him. Indoctrination. I lived in a cult for 40 fucking years. I have been in weekly therapy for 1.5+ years. I hope it won’t take 40 years to heal, because I don’t have 40 more years.", "labels": ["control_and_gaslighting", "emotional_abuse", "self_doubt_recovery"], "primary_label": "control_and_gaslighting", "label_scores": {"emotional_abuse": 3, "self_doubt_recovery": 2, "control_and_gaslighting": 3}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlwlci4/"}
{"text": "Get the book “why does he do that” by Lundy Bancroft asap. It’s on Amazon. This is NOT anger. You will learn that this is an intentional tactic used to gaslight, manipulate and undermine your sense of self. The method he is using with you is called DARVO. The whole “he’s usually nice and supportive” is how abusers GET AWAY with their behavior. The term is called intermittent reinforcement. Please get the book you’ll learn sooooo much. I have a history working in mental health and helping victims of DV and these people basically never change. You need to inform yourself on the reality of abuse so you can fully grasp the degree of what is being done to you. Additionally, even if he’s not the father, your child’s nervous system is already being rewired by this man and the child is at risk for being abusive themselves later in life or becoming victims of abuse at such a higher rate because they are being exposed to this. The best thing you can do is exit the relationship. You’ll be left as a drained shell and your child will suffer the consequences of you staying. Abusers and narcs dont change. The people that change are the victims of their abuse.", "labels": ["emotional_abuse", "parenting_conflicts", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {"parenting_conflicts": 4, "emotional_abuse": 4, "control_and_gaslighting": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlwwl4a/"}
{"text": "My husband has done similar things to me to the point where I was legitimately about to seek out mental help because I knew things were happening that he was telling me weren’t happening. It messed up me up so bad that I started secretly recording our conversations just to prove to myself that i wasn’t crazy.", "labels": ["control_and_gaslighting"], "primary_label": "control_and_gaslighting", "label_scores": {"control_and_gaslighting": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlx3j5x/"}
{"text": "He is not the father of my child. He is usually nice to me. He is usually really supportive. He contributes to the household and I usually enjoy his company. He has actually accused me of gaslighting him in the past. It always revolves around anger. If I say I think he’s angry or something he will say that’s gaslighting because I’m telling him how he feels. I try to tell him that I’m letting him know how I feel. He also then gets really mad if I mention anger and blames me. He says that by saying he’s angry I make him angry and then he is the villain and I’m the victim. I’m not trying to be a victim. I’m not trying to make him the villain either. I just interpret his actions as anger sometimes. I’m just really concerned that he is now calling me abusive. I don’t think I am. Even with all this self-doubt and reality questioning I deep down don’t think I am abusive.", "labels": ["emotional_abuse", "parenting_conflicts"], "primary_label": "emotional_abuse", "label_scores": {"parenting_conflicts": 2, "emotional_abuse": 3}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlunvyj/"}
{"text": "I appreciate this. I just realized if someone told me they thought I was feeling a certain way I’d either confirm it or deny it. I wouldn’t rage and yell at them and call them abusive. I am sure he’s pointed out when I’ve used a negative tone when speaking to my child and I will then apologize and explain to her that I am not upset and wasn’t trying to sound upset. I definitely take criticism constructively and appreciate being called out if I sound bitchy for no reason. I think I was trying to help him in the moment realize he sounded angry.", "labels": ["emotional_abuse", "parenting_conflicts"], "primary_label": "emotional_abuse", "label_scores": {"parenting_conflicts": 1, "emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nluw7ut/"}
{"text": "No they recognize their anger. He knows he’s angry. But you pointing out his anger makes him more angry so he shifts the blame over to you. He wants to act angry and controlling without you complaining about it. These men are not clueless. They have control over their emotions. The anger is weaponized for control purposes. Don’t make the mistake of buying his clueless routine.", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 3, "control_and_gaslighting": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nluodt7/"}
{"text": "Bingo and same. I was so confused that along w/ therapy I started an argument journal, screenshotted his abusive texts, and am now the proud owner of a full shelf of self-help books on emotional abuse, narcissism, toxic people and crazy-making. 🤪", "labels": ["control_and_gaslighting", "emotional_abuse", "self_doubt_recovery"], "primary_label": "control_and_gaslighting", "label_scores": {"emotional_abuse": 1, "self_doubt_recovery": 1, "control_and_gaslighting": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlx49jn/"}
{"text": "Yep. When I called out my narc for a variety of very unacceptable behaviors he said that I’m extremely mean to him, and a jerk, and mentally ill and that by attacking his self-proposed persona of being a “good man”, I was abusing him. That was the conversation that woke me up. If anytime I tried to air my feelings or ways he had hurt me, he would only see it as an attack on himself and his goodness, not trying to create a partnership like I was trying to do. It finally made so much sense, how anytime something was tense and I would try to get clarification on where he was coming from, he would turn on me and accuse me of trying to “win” the argument.", "labels": ["communication_breakdown", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {"emotional_abuse": 1, "communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlvc3ho/"}
{"text": "That sounds awful. I am worried that he is painting me as abusive to people but I also don’t think people would believe him. I also wouldn’t really care if people believed him (unless it was people I loved but they would never think that of me). I don’t really get my self-worth from what other people think. He really cares about his image and what people think of him. I just assume people aren’t thinking of me because why would they? I will look up DARVO. I’ve heard it before but have never really looked into it. I am not protecting my daughter well enough. He isn’t mean to her but he makes his disapproval of things known. Like she had a picture on her phone of a couple book characters kissing (both boys) and he freaked out and went on and on. I had to tell her that I don’t think it should be the background on her phone but that it’s no big deal and homosexuality is okay (my belief but he believes the opposite). I feel like I always have to have follow up conversations with her about the things he says and that’s not me being a good parent. My kid is like the best kid ever too. She’s not defiant. She is always kind and helpful. She’s an avid reader. She’s kind to her friends. I get the same comments from her youth group leaders, her coaches, and her teachers. He will attribute bad traits to her that I don’t think are true at all. I know sometimes mothers can be blind to their children’s faults but I don’t think I am like that.", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlvkoi9/"}
{"text": "Right. So you don't think you're abusive. You've received a criticism, you've had a look at yourself, and that's the conclusion you've reached. What do you think is wrong with you, that you would not be able to go through that process and reach an acceptable conclusion? I think the crux here lies in what you said at the end of your post: 'Maybe I am the problem?' There isn't just one problem here. You ARE the problem, for him. You, being yourself, is an issue for him. But that doesn't mean that you are problematic as an individual. I might have a problem with the colour of your shirt, but that doesn't mean you've got the 'choosing a shirt' part of today 'wrong'. Does that make sense? You get a say in this. You get to choose whether your actions are a problem for *you* or not. You feel a particular way about your actions, and your feelings are facts. For you, that IS how things are. If he wants to see you as a problem, that's up to him. It doesn't mean you are one. A question: Does anybody else who knows you see you as problematic? It's pretty common in abuse situations, particularly with a narcissistic partner, for everybody else other than possibly a parent, to see the victim as a lovely, sweet, kind, compassionate person, someone they can take their problems to and be treated empathically; a safe space. Only the abuser seems to think that the person is a problem, and it's a BIG problem, that's causing ALL the issues and RUINING everything. The victim behaves in a different way in this relationship than they do anywhere else, and finds it easy to believe that something is wrong with them, as the abuser says. Does that scenario square up with your situation?", "labels": ["emotional_abuse", "parenting_conflicts"], "primary_label": "emotional_abuse", "label_scores": {"parenting_conflicts": 1, "emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlurwgj/"}
{"text": "Exactly. In fact I had to let go of a longtime “friend” soon after my NEX discarded me bc he claimed I wasn’t “as much of a victim” as I was claiming to be and invalidated my anger over the abuse. Ppl just don’t get it unless they have truly been thru it.", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlx70t4/"}
{"text": "Yeah my ex would constantly say I was angry. I would be sitting there speaking in a calm tone. But I wouldn't agree with her. Then she would say I was just over reacting because I was angry. I relied on her for telling me everything. I was over parenting I was over anxious all of it. It wasn't til I started hardcore therapy that I stopped trusting her 100%. She had me so twisted. They are so good at using emotions against you.", "labels": ["self_doubt_recovery"], "primary_label": "self_doubt_recovery", "label_scores": {"self_doubt_recovery": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlwlyfv/"}
{"text": "That sounds horrible :( How did your family deal with it at the time? You say they were loving; can you compare their behaviour when you *were* disconnected from reality to his, now? Because even if he *was* right, there are healthy and unhealthy ways to be with somebody as they go through a crisis. I remember an ex of mine (not the narcissist actually, but still relevant) arguing with me in the street because she didn't want me to pay her some money back, after we'd agreed I would. I kept asking why, and she kept fobbing me off, and eventally she stormed away when I asked 'why?' again. We were in the middle of a street party full of bunting, and kids with daft hats on etc, and she screamed at me 'BECAUSE YOU SHOULD BE SPENDING THAT MONEY ON THERAPY!!!!' The relationship ended in that moment, as I realised that even if I *did* need therapy, nobody who loved me would tell me so in that way. It said so much more about her than me, and I recognised quite quickly that I didn't need therapy, and the only thing that was wrong with me was her! Am I making sense? His way of dealing with your alleged 'issues', even if they *were* true, he's not demonstrating love to you, is he?", "labels": ["self_doubt_recovery", "financial_abuse", "parenting_conflicts"], "primary_label": "self_doubt_recovery", "label_scores": {"parenting_conflicts": 1, "self_doubt_recovery": 3, "financial_abuse": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oidcx0/he_called_me_abusive/nlv8oiu/"}
{"text": "Narc ex bf Throwaway account because I'm scared he will see this. My (36F) ex (39M) broke up in Oct 2024. Because he was doing a number of things I didn't like. • caught him on dating apps, but he denies even though my friend saw his profile suggested to her and later he said he didn't cross the line he just went to look but he wasn't going on dates or talking to anyone. • flirting with his coworker, saw the texts on his phone • his mother is constantly getting in our business because he tells her everything and then she will contact me to berate me. His mother actually told me that her son has a right to use dating apps because he hasn't chosen me to be his wife yet. Fast forward I dated someone new. And broke up. Reconnected again with the ex because for some reason I can't get over him. Now he is punishing me for dating another guy. Saying it was cheating and I need to make amends. His demands have been: • find him another girl to sleep with while I watch • delete all my social media • give him my smartphone on Mon-Fri and use a regular phone • make his mom feel more respected Even though I know these are absolutely crazy. I find myself trying to compromise with him and give him some of the things he wants. I feel like it's fair. He really makes me believe that I did cheat on him. And I feel like I owe him. I don't know why but when I see him I can't let go and it hurts when he comes over and then says hes done and he's leaving. I literally fall on the floor holding on to his leg so he won't leave. He has sex with me Everytime this happens. I feel like when he has sex with me that means he loves me because the sex is great. Ever since we broke up it's been better. Can someone help me and tell me what is happening with me? Can anyone else relate? Edit: adding here because I really appreciate everyone's input. I just also wanted to add that he says he really loves me and cares because he shows up to my work and my house and he seldom did that before. He says he's s", "labels": ["parenting_conflicts", "control_and_gaslighting", "financial_abuse", "infidelity_jealousy"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 2, "control_and_gaslighting": 1, "infidelity_jealousy": 1, "financial_abuse": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/"}
{"text": "You didn’t take the time to heal and build boundaries after you initially broke up. You have fallen into the same abusive patterns, except now he is abusing you worse as punishment for taking him back (he thinks you’re stupid to return to the abuse so knows he can get away with it worse than before). If you don’t live with him please take steps to break things off again asap. Get yourself into therapy to build your self worth back and learn about trauma bonding. Your brain is literally chemically addicted to the abuse. You know this is crazy. Let your brain lead you in what you know you have to do. Your heart can follow later after you are safe and in therapy. I know it feels hard, but the sooner you do it the sooner you can heal.", "labels": ["self_doubt_recovery", "emotional_abuse", "control_and_gaslighting"], "primary_label": "self_doubt_recovery", "label_scores": {"emotional_abuse": 2, "self_doubt_recovery": 6, "control_and_gaslighting": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/nlw0m9a/"}
{"text": "Get away and care for yourself. His requests/ demands are bat-shit crazy. That isn't love.", "labels": ["control_and_gaslighting"], "primary_label": "control_and_gaslighting", "label_scores": {"control_and_gaslighting": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/nlw4p52/"}
{"text": "The earliest therapy appointment I can get is Nov 5. He initially said we should go to couples therapy and then he changed his mind and said I need to work on myself first because I don't know what I want and then he will go to couples therapy with me later. But he keeps changing his mind and saying going to couples his him compromising for me.", "labels": ["self_doubt_recovery"], "primary_label": "self_doubt_recovery", "label_scores": {"self_doubt_recovery": 3}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/nlw2ydi/"}
{"text": "What do you mean final discard? What will make him want to discard me when I do everything he asks?", "labels": ["love_bombing_cycle"], "primary_label": "love_bombing_cycle", "label_scores": {"love_bombing_cycle": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/nlw2kja/"}
{"text": "That’s only next week. It’s closer than you think. DO NOT go to couples counselling with this man. He will only use it to abuse you further.", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/nlw3jws/"}
{"text": "It’s not about whether you’re doing what he wants. It’s about whether he’s getting enough supply from you. He’s probably testing to see how far he can push you before you break. Please summon some self respect. You know he’s abusing you.", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/nlw4qn8/"}
{"text": "He’ll resent you for doing them. Of course, he’ll also resent you if you don’t. That’s the beauty of narcissistic relationships! He can’t be happy but he’ll blame you for it. If you do everything then he’ll move the goalposts and ask for more. I’m sorry. When they start to ask the impossible it can mean that they’re done with you (final discard) but they don’t want to break up with you so they can pretend it’s your fault.", "labels": ["love_bombing_cycle"], "primary_label": "love_bombing_cycle", "label_scores": {"love_bombing_cycle": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/nlw4cbl/"}
{"text": "He does say it's my fault. He says I caused it by breaking up with him back in Sept 2024 and it's also my fault for dating someone new when we were not together but trying to work on things.", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/nlw4vpl/"}
{"text": "So, you broke up with him to protect your own boundaries, correct? And now he’s going to punish you by breaking more of your boundaries? You understand this is toxic and crazy, right? Healthy people do not punish each other. This is not an equal partnership.", "labels": ["self_doubt_recovery", "control_and_gaslighting"], "primary_label": "self_doubt_recovery", "label_scores": {"self_doubt_recovery": 2, "control_and_gaslighting": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oijyr8/narc_ex_bf/nlw6jo0/"}
{"text": "Expectation vs. Reality - what comes next? Will post more of my situation at some point, but I'm staring down the barrel of a divorcing/separating from from my suspected NPD spouse at some point in mid-2026 (the timing is complicated.) We've been together for over a decade, and I was still in college when we met. Looking back, I can clearly see how the lovebombing began from day one, and the following years became a pattern of him shaming me into dropping my boundaries, or forcing his will when my intuition told me that something wasn't right. I was even guilted and shamed into saying I love you for the first time, under threat of a tantrum in a public place. I realized last year that I couldn't live like this - constantly chasing the approval and appreciation of someone who refused to accept any of my flaws, and was so obsessed with changing me into what they wanted that they were constantly moving the goalposts and dismissing my continual efforts to meet them as laziness, brokenness, or lack of love. He'd threatened divorce a million times, and I stopped seeing that as my death, because I finally understood that death would be remaining in a relationship with a person unable to tolerate anything but exactly what they desire from me, or it's hell to pay. My nervous system is shot. I jump at fast movements or loud noises, and I'm physically and emotionally exhausted all the time. The hypervigilance doesn't help - I still wind up in one-sided fights that last for hours, with me too numb to speak while he shouts obscenities at me and berates me for not being the wife he deserves when that should be so simple to accomplish. I'm finally ready to cut him loose so he can try to find the wife he deserves elsewhere. But I'm also terrified. I haven't dated a lot of people. And while I've been staunchly child-free in this relationship (despite his demands and attempts to the contrary, which have included trying to tell me that my BC pills are actually poisoning my hormones) I", "labels": ["parenting_conflicts", "self_doubt_recovery"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 1, "self_doubt_recovery": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oilva3/expectation_vs_reality_what_comes_next/"}
{"text": "Soul-sucking. I am not a depressed person. Quite the opposite, actually. Also understand the narc situation quite well - have ticked all the boxes. The problem with my Narc GF - is that I absolutely dread being around her. More specifically - when she works from home. I'm cool most of the time otherwise - just hate when she's home all day. She takes over the whole kitchen with her laptops (instead of working in the office room she already has). Like she needs to be visible to everyone that \"she's working\" (inflated sense of self-importance). The energy she exudes is like something out of a Hollywood movie. It drains the life out of me. Like a black misty cloud that decimates everything in its path. I try to be \"non contact\" but that is not who I am (I'm a social person), so that sucks. Feels unnatural. And every single time I try to bring anything up (as innocuous or innocent as it may be) she picks a fight with me. It just sucks. Loneliness in your own home. Eggshells for no reason. And I cannot get started on a project of my own when she's home for some reason. She'll interrupt me when she can tell I'm enjoying what I'm doing or making good progress. So most of the time - I just sit in my own office and work on my PC. (note that I am stuck here. I have kids with her - and cannot afford to \"leave\" as most people suggest (unemployed stay at home dad) - but that is not the point of this post). I just wanted to vent - to share how awful it is to be with a narc like that. I am seeking out a job where I can be valued, but my demographic makes it a bit hard to get a job that is worth my absence (child care + dog care + property maintenance). Again, not the point of the post. It's just how a narc can seriously drain the life and spirit out of you even though you try everything to prevent it.", "labels": ["financial_abuse", "parenting_conflicts", "communication_breakdown"], "primary_label": "financial_abuse", "label_scores": {"parenting_conflicts": 2, "communication_breakdown": 1, "financial_abuse": 2}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oil85x/soulsucking/"}
{"text": "Can you leave? I mean, not 'leave her' but go out? I used to go out and work at the library, eat lunch in town alone. Got a lot more done for myself.", "labels": ["communication_breakdown", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oil85x/soulsucking/nlwa1ek/"}
{"text": "Yeah. They are marking their territory. Staking a claim on the area. The environmental stress it causes us, is off the charts. I'm about to make an unlikely suggestion, but could you take over her office? It probably wouldn't go down well if you suggested it, but I was trying to think of a way you can carve out your own space. Because that's what you need. I understand the loneliness, walking on eggshells - and its even worse when your own personality is quite bright and cheery. Can you get out much? Dog walking, taking the kids out somewhere? Do you have family/friends who can take the kids off your hands for a bit. Its tougher for dads, I know. You have this sub, this support. Its a step in the right direction.", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oil85x/soulsucking/nlwb7vx/"}
{"text": "How to know if spouse is narcissist? Hi guys, How to know if my wife is a narcissist? - She cheated on me for 8/10 years of our relationship. - She constantly blames me for her cheating, anger, toxic behavior, ruining her life, not giving her what she deserves. - She belittles me in front of my in laws. - She has been physically and verbally abusive towards me for the most part of our relationship but also blaming me for the actions and blaming me for ruining her life. - She does not show empathy even after I found out her cheating. She doesn’t care what I’m going through. - She said sorry for minimal stuff in our relationship but as far as I remember her sorry has no weight. I feel she does not mean that. - I can never have an emotional and logical conversation with her, it mostly ends up in fight and saying how wrong I am and how much I don’t understand her. - She can’t hear no for an answer. Whatever she says we have to do otherwise she will get angry and starts abusive behavior. If I tell her no we shouldn’t buy that, or no she can’t go travel alone, no don’t talk to that guy she cheated me with, no don’t meet the members who supported the cheating and that all results in her getting angry. - she says she will never go for a therapy otherwise I will check with the therapist and get her to do a check/test on her based on her individual session but that’s not an answer. And yes the list goes on. Please help as this has wracked my whole life.", "labels": ["communication_breakdown", "emotional_abuse", "self_doubt_recovery"], "primary_label": "communication_breakdown", "label_scores": {"emotional_abuse": 1, "self_doubt_recovery": 1, "communication_breakdown": 3}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oinsva/how_to_know_if_spouse_is_narcissist/"}
{"text": "Yes. And also, after this exhaustive list of unforgivable things, does it really matter what her issue is?", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oinsva/how_to_know_if_spouse_is_narcissist/nlwvfyw/"}
{"text": "I agree, I don’t want to know. But need to understand so I can talk to my therapist about this in detail, research on how to cope with this and when I talk to her family about this.", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oinsva/how_to_know_if_spouse_is_narcissist/nlww1s3/"}
{"text": "All signs point to divorce, yet he is on his best behavior Hey gang, would love your insights. Will my heart knows the answer, it's hard to hold firm right now. After nearly 3 weeks of awfulness from my husband, he's turned on the nice guy - reflective, overly complimentary, and apologetic. I've had 3 days of near peace in our home. He said he wants this to work. I told him I don't want to live like this anymore. Certainly he can sense that I've walled up. Meanwhile, the universe is sending me all the signs that I need to move on and end the marriage. My concern is that his recent attempts will be used against me. \"I've put in all this effort, and this is what you do to me. This is what you are going to do to the kids.\" It makes me heart hurt. Penny for your thoughts? 🙏🏼", "labels": ["emotional_abuse", "parenting_conflicts"], "primary_label": "emotional_abuse", "label_scores": {"parenting_conflicts": 1, "emotional_abuse": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/"}
{"text": "He's going to blame you no matter what. And he is going to be well behaved and considerate to show that you're wrong about him, but that's gaslighting just like verbal pressure and abuse, just the flip side. You got this, you know what's going on. It won't be long before he can't hold it in anymore and is back to his real self.", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlt6liu/"}
{"text": "He can't keep it up.... they never do.", "labels": ["communication_breakdown", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlte71i/"}
{"text": "When he says “all this effort” you can remind him a person shouldn’t have to beg and threaten divorce to be treated with a shred of dignity and respect.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nltfd4b/"}
{"text": "Hes hoovering in a desperate attempt to keep you under his thumb. If you stay the course he will soon start to unravel into a discard phase since you arent reacting to his performative actions in the way he thinks you shouldve. Theyre really very predictable in their patterns once you learn what youre dealing with. Good luck with extracting yourself and the kidos", "labels": ["love_bombing_cycle"], "primary_label": "love_bombing_cycle", "label_scores": {"love_bombing_cycle": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlt7bo1/"}
{"text": "So you know the facts: if you stay, you will be punished. If you leave, you will be punished. So do the thing that *you* know is best for the kids, and allow him his opinions about you. If he attacks, you don't need to defend. If he tells you you're ruining the kids lives, you can tell him that you understand that that's how he sees it. There's very little he can do except escalate and show himself up, if, whenever he tries to bring you down, your response is some version of 'Yup, gottit.' and it protects you because you reveal nothing to him about your feelings.", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nltfs16/"}
{"text": "This is temporary. Use the time to pad your escape. Get what you can whole you can. Don't be honest. He will use it against you. Someone isn't just going to morph into being another person. Not without something real in life and circumstances and consequences.", "labels": ["communication_breakdown", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nltqh72/"}
{"text": "His behavior is a trap. If he’s capable of treating you this well right now, why wasn’t he doing it all along? If he were a respectful, considerate, pleasant human being from the start, you wouldn’t be on the verge of divorce. He has already shown you who he really is, and how he truly feels about you: that you don’t matter enough to deserve common decency. Trust your gut, not this performance.", "labels": ["infidelity_jealousy"], "primary_label": "infidelity_jealousy", "label_scores": {"infidelity_jealousy": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlu091j/"}
{"text": "How many time he did this before? 30? 50? 100? How many days/weeks of peace can you expect before he treat you like crap again?", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlvl7tx/"}
{"text": "You need to plan in secrecy, telling him anything will get you lovebombed. I faked like everything was the same and my ex didn’t lovebomb. I left him , left his country on a one way ticket home", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlu7vxs/"}
{"text": "> Penny for your thoughts? Here is a dollar ... You are correct he has picked up you are walled off. He is trying to draw you back, and this cycle will continue. He also probably wants sex. Once you give him what he wants he will go back to his normal patterns. > \"I've put in all this effort, and this is what you do to me. This is what you are going to do to the kids.\" That would be guilt tripping and also part of the narc playbook. It just gets worse over time. When I was dealing with my (F) narc, a therapist gave me a good little tool to use. At the end of each day, make a note somewhere (phone, calendar, paper, anywhere you can track things), was today a good day, neutral day, or bad day? Whatever that means to you and how you feel. Track that for a while, 2-3 months. In a healthy relationship you should have far more Good Days than all others. Some neutral days are ok, and a small number of bad days are also ok (because all of us can have a bad day once and a while). But like 70% good, 20% neutral, 10% bad, something like that. So 2 or 3 bad days a month. When I did that it was reversed for my marriage - 70-80% bad days, 5-10% good. I was living for those few good days because they did feel good! But I could see it wasn't healthy overall.", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlua0bs/"}
{"text": "It's guaranteed that he will use anything he can to try to stop you from leaving. But if you stay, the bad behavior will return quickly. Hold firm. You will be protecting your children by getting them away from this monster. They don't need to be exposed to his abuse. They will grow up thinking that's how you're supposed to treat your spouse.", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlukaif/"}
{"text": "It's tough. Honestly, my husband treated me AMAZING for 3 years after I briefly left him for 6 months. I worked in DV, I knew the cycle always repeats itself, yet somehow I fell for it. I thought things were great, I thought our marriage survived and was successful. then he blindsided me, cheated on me with 25 ppl while pregnant and abandoned our kids. So even though the good behavior lasted 3 years, the old came back and slapped me hard", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlvwcss/"}
{"text": "His condition will not allow him to take any blame, past the words. He is not able to be wrong, ever. You must come to peace with the fact that you will be the bad guy. You will be the bad guy is you stay “well I’m not that bad so stop going on” or if you leave “how dare you leave, I was trying”. Victim or hero but never the villain. Absolute 101 for Narcissists. You need to do what’s best for you. Stop looking for hope. He doesn’t make you feel loved, cared for, safe and a priority - consistently so leave. He has put his mask back on and is saying all the things that he knows you have been begging to hear. His actions will not follow his words. Once you relent, his mask will come off again and it will be the same. It’s the cycle. Make a plan and leave, preferably quietly whilst he is at work so he can’t talk/guilt you into staying, then go no contact. Complete ghost. If you have children, speak through a solicitor and have someone with you at pick up/drop offs. Your mind wants to believe he is good and he doesn’t understand. If he doesn’t understand then how can he be “good” when you threaten to leave? It’s manipulation. Please protect yourself. Big hugs and best of luck.", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlua3cb/"}
{"text": "I am going through this too. I have enough wisdom to know by now that it’s just another mask, but dammit I kick myself because it’s almost working. If it wasn’t for the other 25 years of data points, that is. Now, mainly, I ask myself what is her angle. There’s always an angle.", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nluolab/"}
{"text": "My stbxh put on this nice guy act for FIVE MONTHS! He turned it on overnight when I said I didnt love him, and kept it up pretty well. However it felt fake, and the mask sometimes slipped. I'm now divorcing him and I do not feel guilty. Obviously he's playing the victim card, but just because he says it doesn't make it true. Listen to your heart and your gut. If you were dating this man afresh would you want to be with him?", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlx4pkc/"}
{"text": "You are absolutely correct—that is EXACTLY what he will do.", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlxaif4/"}
{"text": "My situation is similar. I said I wanted divorce, looked into it, had him move out. He cried to me for the first time in 16 years and is trying to do everything I’ve been asking for for years now and I can feel my resolve dwindling. But I keep reminding myself it is more than likely just more manipulation. Like maybe he does finally feel bad, but I doubt it will last. I say focus on you and the kids for now and see what happens. I think people can change but only if they REALLY, REEEEALLY want to.", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nluyqmh/"}
{"text": "Thank you. I just saw him for the first time this morning - sensing a shift in energy from him. I think he's fearful of what I'll say to the therapist tomorrow. Like his recent effort erase 2.5 decades of hurt. 🫤 I appreciate the perspective and encouragement. ❤️", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlt9t7z/"}
{"text": "It's a serious mind game, which I need to remember, that's who he is - a manipulator. Wishing you the best. ❤️", "labels": ["control_and_gaslighting", "emotional_abuse", "communication_breakdown"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlte2wk/"}
{"text": "What if the good behavior happens after he’s served with papers and you’ve been separated for a few months/he’s in therapy?", "labels": ["self_doubt_recovery"], "primary_label": "self_doubt_recovery", "label_scores": {"self_doubt_recovery": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlugepf/"}
{"text": "Manipulation was something that I wasn't really tracking until just recently. I chalked those behaviors up to just being selfish. Once I realized what manipulation can actually look and sound like, I'm seeing it all the time. It's like he can't help himself. Thank you for your insights. ❤️", "labels": ["control_and_gaslighting", "emotional_abuse", "communication_breakdown"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlv5tqv/"}
{"text": "It’s still a trap. They just like to make it appear that they’re trying. They’re not. If anything, he’s probably just learning “therapy-speak” to use against you. It’s his attempt to do anything he can to regain his control over the situation. Right now he’s powerless. Once he convinces you that he’s changed and you go back to him or call off the divorce, you’ll be back in his clutches. I’d be very careful.", "labels": ["control_and_gaslighting", "self_doubt_recovery"], "primary_label": "control_and_gaslighting", "label_scores": {"self_doubt_recovery": 1, "control_and_gaslighting": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5gwx/all_signs_point_to_divorce_yet_he_is_on_his_best/nlva2ia/"}
{"text": "I finally understand the “I hope they find someone else” thing. I have reached the phase where I don’t think I would care if I found out my wife was having an affair, and in fact the thought of it gives me a strange sense of relief. No more pressure on me for affection and sex, less obligatory “quality time” with each other, and fewer theatrics when I’m ready to leave. Sounds like a dream. And I don’t mean to be insensitive, I know for some people in this sub this isn’t their experience, but for me with my vulnerable narc I am EXHAUSTED of being the wife, best friend, and (frankly) mother figure of this person who has not matured emotionally in the slightest since I’ve known her. I can’t be another person’s oxygen *and* metaphorical punching bag anymore. At this point if someone else wants to be her oxygen, then I can handle being the metaphorical punching bag until I’m prepared to divorce her.", "labels": ["infidelity_jealousy", "parenting_conflicts"], "primary_label": "infidelity_jealousy", "label_scores": {"parenting_conflicts": 1, "infidelity_jealousy": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi08by/i_finally_understand_the_i_hope_they_find_someone/"}
{"text": "Exactly this! I kept wishing he’d find someone else and he did, literally within a couple of weeks of me leaving him after 2 decades of marriage. No more being sexually bullied, sleep deprived, verbally abused, dismissed etc etc but……now I have to admit I worry about the new supply and what she’s got coming.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi08by/i_finally_understand_the_i_hope_they_find_someone/nlsxdyb/"}
{"text": "Yeah, I can relate. They use us as their emotional scaffolding and a place to project their shame, fear and poor decisions onto. The safest thing is for us is for them to find someone else. Mine had a huge Madonna Whore complex and we basically had a dead bedroom for a decade while he slept with everyone else and justified it by treating me as less than. They’re not fully developed adults and it feels parasitic. Emotional vampires. They will be the worst version of themselves with their spouse and only make an effort with everyone else.", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi08by/i_finally_understand_the_i_hope_they_find_someone/nltyey8/"}
{"text": "I’m always hoping my husband finds someone that he feels he cannot live without and just wants to divorce ASAP. Took years to get here, but I’m at that point now. I look at him and the way he acts and think “he’s the prize?? They can have him!” (Although I really don’t want another woman suffering.)", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi08by/i_finally_understand_the_i_hope_they_find_someone/nluzkj6/"}
{"text": "I left my marc husband and divorced him two years ago. He remarried recently. What am I feeling? I feel so terribly sorry for his new wife. She has no idea what she's married.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi08by/i_finally_understand_the_i_hope_they_find_someone/nlwyi16/"}
{"text": "I had reach a similar point few years ago without realizing that my spouse was a covert narc. 2 months ago, his mistress sent me an avalanche of screenshots of their conversations... it shattered me and my world. Knowing that he was cheating was not the problem, what broke me was the understanding of all the cruelty he had for me... today he is love bombing me and our kids to the extreme. Here I am feeling stuck again", "labels": ["love_bombing_cycle", "parenting_conflicts"], "primary_label": "love_bombing_cycle", "label_scores": {"parenting_conflicts": 1, "love_bombing_cycle": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi08by/i_finally_understand_the_i_hope_they_find_someone/nlvbdwt/"}
{"text": "I’ve wished for this for a while. I even joked to some friends that I wish there was a service where I could hire a perky 25 year old to engage my husband and convince him to leave me. Then after he left me, I’d pay her for her services. Almost like hiring a hitman, but not. I guess it would be like a catfish for hire?", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi08by/i_finally_understand_the_i_hope_they_find_someone/nlwj3ij/"}
{"text": "Oh yeah, I realized I was emotionally checked out of the marriage when his accusations that I was cheating made me laugh, because I couldn't imagine something less appealing 😆 dealing with *another* man too? That sounds so utterly exhausting and unappealing lol. Then, when I thought about the idea that it was him projecting and maybe he was cheating, I just didn't even give a shit anymore to bother finding out.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi08by/i_finally_understand_the_i_hope_they_find_someone/nlx89yu/"}
{"text": "Exactly, I also don’t want someone else to suffer, I guess my hope is it’ll be a person with more strength than I had to nope out at the first signs of issues. And of course I always have hope for my wife that she’ll be able to grow and change, I have seen small evidence here and there that’s it’s not completely impossible, so in a dream world she’d be better for the next person. Or maybe she’d take more care in choosing someone who won’t trigger so much in her, if that’s possible.", "labels": ["communication_breakdown", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi08by/i_finally_understand_the_i_hope_they_find_someone/nlv77zp/"}
{"text": "How to be ok with her moving on so quickly? I left 1 week ago and she has been talking to at least 7 different guys already I told her no men allowed in my house. Last year when I left she had a few over… I have my 2 babies right now so I don’t know why I even care I guess it’s just hard to accept how little I must’ve meant to her after 5 years… I guess I just have to accept that’s what a verbally abusive, deceptive, gaslighting narcissistic does... I guess you could consider the time she punched me in the face too just because I wouldn’t hand my phone to her and she had me blocked in a room and was blocking the door and I forced my way past her I felt like the Lord led me to the relationship at one time, and I’m sure I was see it now it must’ve been for the purpose of i would’ve never had my 2 babies, went to my current church, joined my first small group, joinedy addiction recovery group, began my self reflection and healing journey or have grown in my faith and learned my worth and value as a child of God as I have since attending my current church. I certainly wouldn’t have the solid community of other believers that I am apart of now. So I am thankful just need to work on not caring and understanding I can’t control her. Just disgusting to think she could just go sleezing around so quick. Must be because she needs another roof over her head… I told her she needs to be out of my house by Dec 1st so I can sell the house. I also worry so much about who she brings around my babies when she has them.. we switch off every 2 overnights. My boy is about to turn 2 on and my girl is about to turn 3 on I sat on opposite side of church Sunday morning, and let her attend foundation group we’ve been going to and I didn’t go since we sit at the same table. I was setting that boundary that I’m not going to just give her that comfort of my presence and act like nothing has changed. Last year when I moved out I only took clothes. This time I took everything that was mine. Mainly", "labels": ["control_and_gaslighting", "parenting_conflicts"], "primary_label": "control_and_gaslighting", "label_scores": {"parenting_conflicts": 1, "control_and_gaslighting": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oiaovf/how_to_be_ok_with_her_moving_on_so_quickly/"}
{"text": "Think it like this… think of all the abuse she has put you through. Think of mental fog you have had. Now you don’t. Now imaging that poor replacement of yours. Give him a sympathetic nod. No need to explain anything to anyone. Just be faithful to yourself. The rest will follow.", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oiaovf/how_to_be_ok_with_her_moving_on_so_quickly/nlu34jo/"}
{"text": "She needs it, she needs the supply, she needs the validation of others. But you don't need her; you have God and your babies. Congratulations on the progress, keep it up. You can do it 🙌✨💕", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oiaovf/how_to_be_ok_with_her_moving_on_so_quickly/nluafwi/"}
{"text": "she is doing it specifically to get under your skin to see if you will be a sucker and take her back, which means she will be given a pass for her shitty behavior. congrats on 8 weeks sober", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oiaovf/how_to_be_ok_with_her_moving_on_so_quickly/nlu8csb/"}
{"text": "Girl, fuck him !! 😭 He is not that important. don't worry about what's gonna happen in the future worry about what you need to do NOW which is leave and get a divorce. That is your only option right now sister", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oij8k1/aggressive_husband_but_pregnant/nlweamk/"}
{"text": "Any of your spouses act nice to get laid? I feel so dumb and gave into the act this weekend; he actally was being nice and I stupidly fell for it. Today was Hell all over again. I think maybe I just got stupid over getting attention and for once it felt like he was a real person. It’s crazy how they can change into two different people. I’m done with this it’s so sad and so manipulative. I feel really dumb too.", "labels": ["control_and_gaslighting"], "primary_label": "control_and_gaslighting", "label_scores": {"control_and_gaslighting": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/"}
{"text": "I refuse to have sex anymore but he used to be like this to get sex.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlqoksv/"}
{"text": "I haven’t touched mine in over a year.. I actually feel disgusted with myself whenever I think about him in a sexual way… yuck. ETA: sorry OP I spoke without providing even a single commiseration. Don’t feel dumb, it isn’t you; being with a narcissist is the loneliest feeling we’ll feel.. it’s truly not just “being alone and wanting someone” it’s **also** being so desperate to love and be seen that we *forget* who they are and for a brief second our brain lapses in judgment and we believe their words and actions. It hurts- a LOT. And once you decide to leave it’ll hurt all over again, you’ll feel like it’s YOUR fault things are messed up, and you’ll feel almost like you’re abandoning your puppy on the side of the road. You MUST remember **THIS IS WHO THEY ARE**; their brains are wired AGAINST empathy and sympathy; they cry wolf until they get what THEY want and then they discard the rest. Don’t feel stupid, the only thing worse than loneliness is the loneliness we feel sitting next to the narcissist who is sucking everything else dry on top of it. I have barely looked mine in the face; I find him utterly disgusting, a terrible person inside and out; and every time he looks in the mirror and sings about how handsome he is (I am not joking) I roll my eyes so hard I have to smash my head in the wall to bring them back. I feel like most of us can’t engage with our N anymore because real human beings have emotions and it would be like fucking a demon at that point; feeling their evil and darkness through their eyes, knowing they’re going to screw you over, belittle and disrespect you, how could we even want them in that way? For me at least, it’s akin to fucking my worst enemy- and that’s NOT a turn on.", "labels": ["emotional_abuse", "love_bombing_cycle"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1, "love_bombing_cycle": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlqyjjj/"}
{"text": "Mine does this every time he wants to have sex. He's only nice when he wants sex and it doesn't continue after sex. It's really weird, I called him out on it and he pretends it's not happening. He's mad I don't like having sex anymore now.", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlqqmtm/"}
{"text": "I have a text thread of him explaining to me he will only be nice if I give him sex. I think I have one of the more dumb narcs out there. He literally admitted to me that he is mean on purpose if I’m not giving him enough sex no matter how I feel btw", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlrh1c4/"}
{"text": "Mine only acts nice when he wants something, I always have my guard up when he does that", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlr6job/"}
{"text": "My wife thinks I’m withholding sex to punish her. It’s not. It’s self defense. Sex with someone who has zero empathy.. I just can’t anymore.", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlrjmb7/"}
{"text": "Yeah, but it got to a point where I refused. And he still wouldn't take \"no\" for answer. I've been subject to intimidation and sudden physical moves just to get me to have sex with him.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlr5gl7/"}
{"text": "if you mean ex-spouse, yep, I'm just as guilty of giving into it also. although, the last two times I said no. the first time I said no was very empowering, but the second time I said no, I actually wanted to, I just happened to be very sick. actually, she's been very nice every since we've been divorced. she actually wants to be friends. I gave it a try and hung out with her several times, and it was fine. we always were great friends anyway as long as she was in a good mood. but then I thought about everything she did, and how she still hasn't shown any remorse, so I told her that she didn't deserve a friend like me.", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown", "love_bombing_cycle"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlqsel6/"}
{"text": "Mine acts all nice until an hour or two before bed ( when the beer is almost gone) and starts with the rude comments, dirty looks, name calling. Then gets even more pissed off when he doesn’t get F*ked. We don’t make love, or have sex he says wanna f*k or guess I’m not getting f*ked again…. Nope!", "labels": ["control_and_gaslighting", "communication_breakdown", "emotional_abuse"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlrie0h/"}
{"text": "Oh hey literally going through this. He was so kind up until I gave it up last night. Now he’s suddenly moody and back to his ways again. Every single fucking time. Sometimes I make him hold out because I know he’ll be nice and sometimes I get something out of it, other times I get a guilt trip, it’s random lol", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlrs6nd/"}
{"text": "Yes. All the time. Mine used to tell me it would help him feel closer to me. That we grew apart. Lying sack of sh*t. They are all manipulative, habitual liars. It’s not your fault OP for wanting a genuine connection with your spouse. We have probably all ignored the bad behavior, because we so desperately desire that glimmer of a healthy, caring relationship. We want to believe our spouse loves us and has our best interest at heart. Unfortunately, these are hollow souls with no empathy or heart. I hope you find the courage & strength to leave.", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlrowwd/"}
{"text": "My ex would act nice to an extent before he would switch. For example, he would act nice until he found out I was in my period. Then he said he needed to know ahead of time when my period would be. I asked why. He said “So that I know you’re not being a b——h on purpose.” If something got in the way of him getting laid such as me, the baby or obligations- he would get very upset and nasty. He’s an ex now. My new partner doesn’t do that. He’s always nice, he doesn’t pretend to get laid. If he doesn’t get laid, sometimes he’s even sweeter. One time he asked when he got into bed. He came home much later than me. I told him he was too tired. He said “Can we cuddle instead then?” Absolutely, sir. Acting nice to get laid isn’t right. Let’s not normalize it.", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nltf7ro/"}
{"text": "That really sucks. I am sorry you have to deal with that. My STBXW would belittle me into having sex. If we went too long in between it was always what kind of man doesn't want to f his wife. It would be so much I would wish she would cheat on me so she could be happy. I would dread coming home when I could begin to feel her anger rising.", "labels": ["emotional_abuse", "infidelity_jealousy"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1, "infidelity_jealousy": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlt75cy/"}
{"text": "Yeah mine did. I gave in last weekend and it was horrible. He literally just laid there doing absolutely nothing and when it was over had the nerve to ask me to make him food. Now he is back to his normal behavior and irritating me every few minutes.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlu5m71/"}
{"text": "I feel so violated and stupid. I think because it was a day of not chaos I gave into it. I honestly felt normal and should have known better. Today’s he’s the exact same crazy lunatic. It’s so weird and just not ok. I don’t get how they are really two different peolle", "labels": ["control_and_gaslighting"], "primary_label": "control_and_gaslighting", "label_scores": {"control_and_gaslighting": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlqq3de/"}
{"text": "Ugh, Sabrina Carpenter has that new song where she sings if the guy does the dishes he’ll get what [he] want[s] and it infuriates me", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlr0kf3/"}
{"text": "They do it for an ego boost too. Mine is having/had affair with co-worker. We are divorcing. I also think he has been working on another side relationship - a “walking buddy” divorced woman. He commiserates with her. I doubt she knows anything about the affair partner. I’m sure he gives them both sob stories about our marriage. Definitely sexted and slept with AP. All the while crying and telling me he felt sick about everything and had ended things with her. As the divorce progresses, I’m getting documents that show his phone records & credit card records. Bastard was calling/texting and buying AP shit all along. While pretending he wanted to work on our marriage. He (61M) thinks he is some kind of ladies man. They are truly disgusting & evil.", "labels": ["infidelity_jealousy"], "primary_label": "infidelity_jealousy", "label_scores": {"infidelity_jealousy": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlrhdh1/"}
{"text": "Mine admits things like this too like it's perfectly logical and not sociopathic. The last time we had sex he said, \"I guess that's worth paying rent for,\" like he doesn't have to pay his half rent unless he gets to have rough sex against my will.", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nltgi93/"}
{"text": "Either when he wants something or deep in his subconscious he’s feeling guilty about something", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nluehbu/"}
{"text": "Mine was very “handsy”. Always grabbing body parts - like I should be turned on by it. It felt more like sexual assault. Revolting. We are about a month in to divorce process and still under one roof. He then started walking around naked from the waist down. Like a form of intimidation? Or maybe he thought I wouldn’t be able to resist?? So gross.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlrrz3v/"}
{"text": "Sometimes it's hard to resist the romance with these narcissistic guys. \"wanna fk?\" What woman wouldn't be swept off her feet with lines like that.", "labels": ["control_and_gaslighting", "love_bombing_cycle"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlrv8vu/"}
{"text": "I did too when it was all about his pleasure with no regard for mine.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlrkpk6/"}
{"text": "Mine did this too! Walking around naked and putting his penis in my face then just standing there. I'm like, no... He also just randomly sticks his hand really hard in my butt crack or vulva if I bend over to get something or if I'm cooking and he used to randomly honk my breasts really hard. Later he'd complain that I rejected him because I didn't want sex after his advances. I don't know if he's kind of dumb or doing it to upset me on purpose. It's upsetting either way.", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nltgvsd/"}
{"text": "thank you. I always thought I did love and respect myself, but I recently had a rebound relationship with a woman who reset my standards completely. after being married to two very jealous, spiteful, and vengeful women, I now see that I set the bar way too low. they had me convinced that I was the problem. but after briefly dating an emotionally mature and stable woman, it is wonderfully refreshing to learn that I was never the problem. unfortunately the rebound relationship ended due to circumstances beyond our control - she's a lesbian and I'm a dude, but it was super fun while it lasted.", "labels": ["control_and_gaslighting", "infidelity_jealousy"], "primary_label": "control_and_gaslighting", "label_scores": {"control_and_gaslighting": 1, "infidelity_jealousy": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nls4h3l/"}
{"text": "Mine did the same to me too! There was one time where he squeezed my breasts so hard that he left bruises on them. He even ran a needle tip on my breasts once--it was scary because I didn't know if he was going to push down. He was never serious about me but he still thought it was fine to sexually assault me. I am sorry to hear about what you went through :(", "labels": ["emotional_abuse", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nlttq8j/"}
{"text": "That's so scary, he probably knew you were afraid with the needle when he did it, too. Absolutely sick people.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nltwjm8/"}
{"text": "He used to stick it in me without a condom too...against my wishes. He just lost his temper so much and I felt like I had to walk on eggshells. He even forced anal on me once too.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohudp1/any_of_your_spouses_act_nice_to_get_laid/nluzjjm/"}
{"text": "This is what he’s done", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oioeig/this_is_what_hes_done/"}
{"text": "What to do when the narcissist threatens to \"battle\" you for not accepting how they see things My narcissistic ex went through an episode of psychosis I offered to help get him help he refuses to admit it so I asked him to keep messages about the children only then he said that he didn't want to but he will battle me", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oiidhi/what_to_do_when_the_narcissist_threatens_to/"}
{"text": "Then what you do is only acknowledge messages about the children. Anything else, just delete. He is your ex. The only bind you have with each other is the children. You are not responsible for him or his life outside of that.", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oiidhi/what_to_do_when_the_narcissist_threatens_to/nlvovf2/"}
{"text": "Its easier said than done, admittedly....but he'll get the message. :)", "labels": ["communication_breakdown", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oiidhi/what_to_do_when_the_narcissist_threatens_to/nlvtbbf/"}
{"text": "Worried about HIS feelings Now that I told him we need to separate, I find myself worried about his feelings and how this is going to affect him. He didn't care about mine and even told me so, but there I go caring about his. Does this back and forth ever stop???", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oint9f/worried_about_his_feelings/"}
{"text": "Is this another narcissistic move I’ve been pretty cold to my husband because I’m just over the manipulation and the mistreatment. For example, I was holding our cat and kissing him on the head and he said “don’t kiss him, he’s dirty.” So I kissed him more and he said “ok you can’t kiss me anymore” so I kissed the cat more and said “fine by me.” I’m playing the long game right now trying to figure out a plan for getting out and thinking about my two boys. The other day he said “you don’t love me you only tolerate me.” He said this in front of my 5 year old so of course I said “I do love you” he said “those are just words” I almost felt bad… but should I?", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/"}
{"text": "Reverse it. Ask why would I just tolerate you??? Aren't you a great guy that never causes me any issues??? He feels that way for a reason. He KNOWS he's a piece of shit. Don't get stuck in those silly conversations", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nlrck0l/"}
{"text": "Mine says things like that all the time and it’s true, I do. But what’s frustrating is he has no interest in fixing it or being curious about fixing it. It’s just statements like “you think I’m a horrible person”, “it worries me that you think so little about me”, like he is inside my brain and knows all this stuff about me but not wanting to rectify or find out more. It’s being a victim and designed to make me say “no no no I don’t think that at all, you’re a GOOD man”", "labels": ["control_and_gaslighting", "communication_breakdown", "emotional_abuse"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nlsaoer/"}
{"text": "Mine tried to use a suicide threat to control and manipulate me the other day. I really wanted to ask him which piece he wanted.", "labels": ["control_and_gaslighting"], "primary_label": "control_and_gaslighting", "label_scores": {"control_and_gaslighting": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nlr63r5/"}
{"text": "Then why should you feel bad? It's not your fault if you don't like him. I'm sure he's had a hand in it..! For the sake of your children, don't express love you don't feel. You are teaching them that 'I love you' is a way to keep the piece when things are chaotic. They are in their formative years; what you are doing now will be what they do in their adult relationships. It will be what feels like home to them. Don't say that you don't argue in front of them so they don't know what's going on: I was the 5 year old, I remember it well. Your safest bet is to validate your partner's feelings. I know it sounds counterintuitive, but bear in mind that *he's as mad as a box of frogs*. You know when someone has dementia and the best thig to do is just go along with them? Do that. You can say 'I understand why you feel that way', and 'Thank you for sharing that with me', and 'Yes, I hear what you're saying' and 'I see your perspective', and simultaneously think he's being a complete arsehole. Show your kids that creating civil distance between your own emotional world and that of an abuser is the healthy way forward. Daddy can stand there calling you an arsehole, and you don't have to prove to anybody that you're not. 'OK, I understand your feelings.' lifts you high above any debate, which is fantastic, because there *is* no debate about who you are or what your feelings are.", "labels": ["communication_breakdown", "parenting_conflicts"], "primary_label": "communication_breakdown", "label_scores": {"parenting_conflicts": 1, "communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nlten6k/"}
{"text": "I dunno... does *he* feel bad about his behavior? let that be your answer", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nls38hf/"}
{"text": "This is familiar. Once my spouse understood I was setting boundaries and refusing to participate in his narc games, he flipped everything around. Then it was \"you don't love anymore\" and \"thanks for letting me know you think so little of me.\" This was after I discovered he had sold some of my video games to buy alcohol. He lied in my face, and he knew I knew. But I refused to react or get into a fight about his stealing. They hate that, and they try everything they can to get a rise out of you.", "labels": ["communication_breakdown", "self_doubt_recovery"], "primary_label": "communication_breakdown", "label_scores": {"self_doubt_recovery": 1, "communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nltx3l7/"}
{"text": "Mine hates when I pet the cat. Demand I stop petting him when we’re talking or watching tv because “it stresses him out”. Our cat does shed a lot, and he gets a bit too enthusiastic when he’s being petted, so that is his reasoning why it stresses him out. It doesn’t matter that the cat is enjoying it. In his mind, inconveniencing me = bad so it must stop!! Poor cat. He’s elderly too, so my feeling is we should just comfort him and enjoy him as much as possible in his winter years. (And yes, he pulls the same “you hate me/tolerate me” bullcrap too.)", "labels": ["control_and_gaslighting", "emotional_abuse"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nlt85w1/"}
{"text": "Dont feel bad because he is going to make you the villain anyways", "labels": ["communication_breakdown", "emotional_abuse", "control_and_gaslighting"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nltjvjj/"}
{"text": "Isn't he right?", "labels": ["communication_breakdown", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nls4mz9/"}
{"text": "That’s because all he cares about is his own image and what you think of him. He will never do the work to be a better person, he will just find someone else who thinks the sun shines from out of his backside.", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nlsh3yl/"}
{"text": "My now ex was like that about his Belgian Malinois. He also didn't like that any time he was \"alpha\" to the poor dog, the dog would always run to me as if I could help him and he would be like,\" don't run to her, she won't save you!\" And claimed, once, that he was glad the dog was afraid of him when I mentioned how Koda was scared of him... \"As he should be\", he said. His dog *loved* me and he would try to keep him away from me when we were fighting, as punishment.", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nlufumc/"}
{"text": "My stbx killed all my plants by secretly over watering them. I’ve had plants my entire life. No coincidence that they ALL died. Finally he admitted it by saying, I didn’t know you were watering them too! Because I like plants. Of course I was not allowed to have anything that could possibly make me smile. Separated five months, I have received so many cuttings and seedlings, even full grown plants, from friends and family that I’m running out of room for plants. 11f was exasperated: everywhere I look I see green! Can’t you stop?! Nope. That’s what I wanted. Deal with it. They’re important to me for healing.", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nlwnk7b/"}
{"text": "1000% he is", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohwctx/is_this_another_narcissistic_move/nlt5kv0/"}
{"text": "Missing abusive ex I finally managed to leave my ex for good but the final time I saw him to discuss the break up, he raped me multiple times. He refused to leave my flat and put a lot of pressure on me not to get emergency contraception after the sexual assaults. Once he left my flat, I managed to get emergency contraception and get seen by the sexual health team for medication. I did report the sexual assaults to the police even though I don’t want it to be further investigated. I don’t think I’ve got it in me right now to proceed with an investigation. Also, I’m worried it might just make things worse and I’m not hopeful that the police will even do anything. The last message I received from my ex after I confirmed the break up through a text was him telling me he wants to be told of the abortion should I get pregnant from what happened. It crushed me. He knew my worst fear was ever being put in the position where I would have to get an abortion and I couldn’t believe how cold he was. I think it really hit home that he likely never truly cared about me. I’ve now blocked his number and haven’t spoken to him in over a week but I’m reeling from everything that has happened. I can’t fathom why he did the things he did in our relationship. I’m still in shock. I don’t understand why I still love him and can’t stop missing him at the same time. Part of me wants to reach out to him but I keep having to remind myself of why I can’t anymore. I feel like I want answers even though I know he won’t give me any. I’m really struggling to not think about him and focus on moving forward I would really appreciate any advice you guys have as I’m struggling a lot mentally right now and have found the advice from you all helpful before. Thanks for your help.", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {"emotional_abuse": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi9hup/missing_abusive_ex/"}
{"text": "Why do you feel like you’re dying after you end things ? I left today. I’m 6 months pregnant. I have countless saved journal entries and screenshots to look back on as reminders of the abuse… as well as the memories from all the awful moments. But why do I feel like I’m dying? I’m questioning myself. I want to cave. It’s so painful, it just feels like I’m dying. Why the fuck does my brain want to remember all the good times in a moment like this? Why does saying goodbye feel so hard, even though normally I don’t want to be with him at all? He’s caused me so much suffering and pain, and to be treated so so so horribly during such a vulnerable time made it that much worse. But it doesn’t take away the fact that I love him and care for his well-being. Right now he’s being cold and apathetic. He said not to contact him unless it concerns the baby. And that from this point forward he only cares about it the child. Not me. Just interesting I guess. I think I’ll always care and want the best for him even despite all the horrible things he done to me. And I want the best for his wellbeing so he can be a good father. But even thinking about sharing custody gives me anxiety as I know this child will be used as a pawn. I feel like I’m drowning. I’ll be staying with friends for the next month until I find my own place. Please tell me it gets easier? I’m terrified. I’m sad that I haven’t had support during this pregnancy and have even less now. I feel bad for my unborn son. It’s not the life I pictured.", "labels": ["parenting_conflicts", "emotional_abuse"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 4, "emotional_abuse": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohytyq/why_do_you_feel_like_youre_dying_after_you_end/"}
{"text": "It's the same as the reason you stayed, even though he was horrible. The truth is too hard. YES IT GETS EASIER. (I feel like that warranted capitals, because it's really really important for you to know, right now) You may not be able to picture this, but once you've recovered a bit, your brain will stop focussing on the 'terrible loss' of the good parts and hope. It will start to look at the bits it has *never* wanted to have to process. That feeling you have that you will always love him will change, as your internal systems gradually piece together the confusing relationship you just had. He will look worse and worse until the thought of him makes you go 'Ew!' But the important thing to note is that this is something that will happen to you naturally, rather than something you 'do', and that takes the pressure off the idea that you 'should' feel better by now, or 'why am I still struggling with this?' It's like waiting for a broken leg to heal; it's frustrating, you want it to be better NOW, but all you can do is nurture it and allow it to heal at its own pace. So, you are now very much in a place where you need to nurture yourself. 'Why the fuck does my brain want to do this?!' is a punishing attitude and will slow your healing. All your questions about what's happening within you have a perfectly logical answer, and all of it makes sense. You are thinking about the good times because when we lose something, it is natural to think about it. You feel like you are dying because of the depth of your injury (not just the break up but the relationship itself) Saying goodbye is hard because there is more than one side of him, because you've been attached, because you have to let go of hope. Validate yourself. Everything that you feel makes sense. All you can do is take good care of yourself and your little one to the best of your abilities, and allow healing to occur without self punishment. It takes a while; allow it. It is awful to go through this whilst pregnant, a", "labels": ["self_doubt_recovery"], "primary_label": "self_doubt_recovery", "label_scores": {"self_doubt_recovery": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohytyq/why_do_you_feel_like_youre_dying_after_you_end/nlsmirq/"}
{"text": "A few things to think about. What you are describing is malignant narcissist behavior. This is how they emotionally punish someone. Malignant narcissistic behaviors include targeted and intensified attacks during vulnerable times—pregnancy. This is sociopathic, in order for you to protect yourself and pregnancy, distance or exit is the only way. He is ill and no amount of rationale or moral responsibility will ever change this. Neither will your hope or your own efforts have any effect on this reality except being exploited for it. Narcissistic disorder is not a choice, it’s a consequence, and if you surround yourself with illness—that’s exactly what you will experience yourself. Emotional distress during pregnancy isn’t just dangerous for you but the life you carry and support. Postpartum depression is a risk in the best of circumstances, what do you think happens when you add a narcissist into the mix, it can be disastrous. How did you feel while in the relationship? There’s a difference, you are dealing with the pain of what’s already been done, and without the phony bread crumb gestures they use to keep you emotionally bound to their fake identities. Your head will clear in the absence of manipulation if you allow yourself to grieve what’s been lost without the added complication of manipulation that’s inevitable in their presence. The difference is the absence of manipulative emotional confusion you experience while in it. A phony gesture here and there, just enough to have someone clinging on to the hope that their former partners will return, and all will be right in your world once again. That’s the hope they count on, all your strengths and positive traits, exploited so they can keep harming you. 💛", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohytyq/why_do_you_feel_like_youre_dying_after_you_end/nlt1fh6/"}
{"text": "Girl, all I read so far was the first couple of lines. I am 5 months pregnant and I left 1 month ago. This is the hardest thing I have ever done, and I mean that with my full chest. I am still in contact with him because we have a toddler also. Initially I literally felt like I was going through an exorcism because he decided to ghost me the first week and not even ask about our daughter. I think it hits a lot harder when you are pregnant because you crave, want and need care from the person you procreated with and they just don't care about anything but themselves. Please give yourself grace. It's so hard and you are so valid for what you are feeling.", "labels": [], "primary_label": null, "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohytyq/why_do_you_feel_like_youre_dying_after_you_end/nltfj21/"}
{"text": "The trauma bond is real, although it’s got to feel worse since you’re pregnant w/ his child. I can’t even imagine going through this divorce while pregnant. It’s a painfully addictive chemical and biological bond. Please stay strong, you’re doing an amazing job already by having left! Hugs.", "labels": ["financial_abuse", "parenting_conflicts", "self_doubt_recovery"], "primary_label": "financial_abuse", "label_scores": {"parenting_conflicts": 1, "self_doubt_recovery": 1, "financial_abuse": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohytyq/why_do_you_feel_like_youre_dying_after_you_end/nlvp6f7/"}
{"text": "They’re all always in such a hurry to find the next one aren’t they? It’s absurd. They can’t love because mine spent over 20 years with me and was barely separated from me when he was spending countless thousands of dollars on dating sites and adult chat sites and talking about finding his real true love. Yet just a week prior talking about how he couldn’t live without me or ever be with anybody else. They’re so messed up mentally ill maybe. It takes a while, but you kinda learn to not take it personally I guess. They’re a hot mess and frankly, I feel so good to be rid of it.", "labels": ["emotional_abuse", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1ohytyq/why_do_you_feel_like_youre_dying_after_you_end/nlti7sj/"}
{"text": "Started the plan to leave I'll try to keep this short but I did start the plan to leave. I called my lawyer and told her I wanted to go ahead with divorce and I'm just waiting for her to call me back so we can review some stuff. I have to tell you I feel free and that a big burden has been lifted off my chest. I told him and he reacted the way I said he would he just said no problem. I won't go into the whole thing but I knew deep down he never wanted to keep this going marriage wise but he did want the supply and I know he's going to bad mouth me and stuff and I don't even care. I stayed calm but I did get out the feelings that I had on how I had been treated for quite a long time now and that it was a shame it had to come to this because he has the world in his feet. But I had to stop hoping that he was going to care because that's what What's keeping me hanging on And I think I mentioned that To him. I'm in counseling and I'm going to continue to go because I need it more than ever. Like I said for now it's want to let you know that this group has helped me a lot and I'm sure I will have more to say as time goes on.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oicj5z/started_the_plan_to_leave/"}
{"text": "Yeah he just texted me and said that he doesn't think things will change because he knows he's abusive and he doesn't see that changing. I was floored he actually admitted it and then to say that there was no change in it he has never done that before.", "labels": ["emotional_abuse", "communication_breakdown", "control_and_gaslighting"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oicj5z/started_the_plan_to_leave/nlvx3ts/"}
{"text": "Does that sound like the beginning I'm trying to keep me hanging on? By admitting to being abusive and then saying he doesn't think that can change?", "labels": ["communication_breakdown", "control_and_gaslighting", "emotional_abuse"], "primary_label": "communication_breakdown", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oicj5z/started_the_plan_to_leave/nlw12oh/"}
{"text": "what you do when you are tired with tests? I have npd wife. I recently heard that normal women test in the beginning of relationship and broken ones always.she is always doing this. sometimes she stops. I'm bad at finding pattern. maybe some of you have broken the code? what to do to make her pause the tests? I think I'm passing all of them with joking or not reacting. however it's makes me feel shitty if they happen too often. any tricks? tips?", "labels": ["emotional_abuse"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oibyec/what_you_do_when_you_are_tired_with_tests/"}
{"text": "Stop trying to find the solution. There isn't one. If she has NPD, you will be continually abused for the rest of the relationship. It's not a puzzle, it's your life. Get out as soon as you can, so that you can recover and enjoy as much of your life as you can.", "labels": ["self_doubt_recovery"], "primary_label": "self_doubt_recovery", "label_scores": {"self_doubt_recovery": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oibyec/what_you_do_when_you_are_tired_with_tests/nluho72/"}
{"text": "Yesss she's not a puzzle. There is no solving it. There is only torture until you can get out.", "labels": ["emotional_abuse", "control_and_gaslighting", "communication_breakdown"], "primary_label": "emotional_abuse", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oibyec/what_you_do_when_you_are_tired_with_tests/nlur3i2/"}
{"text": "I had a dream about my NEX last night and I feel weird about it I woke up this morning from a dream about my NEX-wife. We have been separated for over two and a half years and are in the process of getting divorced. I have also been in a happy and healthy relationship with my new partner for more than two years. She was also in a relationship with a narcissist for many years. In my dream, I visited her in a psychiatric ward, but from the outside it looked more like a hotel in Las Vegas (last night I was thinking about a trip we took 12 years ago that started in Las Vegas, so that's probably where that came from). I waited alone in her room, then she came in and wanted to hug/kiss me. I told her that I didn't want to and that I had a new partner. She then snapped and asked if I had a child with her. I said no (I have a wonderful eight-year-old stepson, but I won't be able to have any children of my own). She then told me to leave, I said that was probably for the best and left. I remember feeling kind of sorry and guilty for her. Then I woke up. My partner was already awake, so I took her hand and told her about the dream. This situation with wanting to hug/kiss against my will happened a few times shortly after the breakup. Nevertheless, the dream left me with a very strange, unpleasant feeling. My ex was actually in a psychiatric ward for a few weeks last year. However, I don't know any details about it, as I only have a little information from a friend to whom she described her side of the story. In any case, she has been delaying our divorce for 1 1/2 years, citing her mental health problems, which allegedly make it impossible for her to take care of anything, but at the same time she travels around the country and attends music festivals (I saw her at one myself, and at another she gave a ticket to a mutual friend who was there). I don't even want to know what terrible things I'm supposed to have done to make her feel this way. By the end of 2023, I was so broke", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5hz5/i_had_a_dream_about_my_nex_last_night_and_i_feel/"}
{"text": "It feels real because it is real—not what happened in the dream but the feelings around everything that happened. 1. You visited her in a psych ward (because, yes, she’s crazy) 2. You waited alone for her (because you’re waiting on her for the divorce) 3. She wants to hug/kiss you (because she loves attention and doesn’t respect boundaries) 4. She snapped (because she’s jealous that you have a new partner) 5. She asked if you have a child with your new partner (because you do, no, not biologically but you do) 6. She told you to leave (because the discard) 7. You said that’s for the best (because, yes, it is) 8. You feel sorry and guilty (because that’s how you felt in the relationship)", "labels": ["control_and_gaslighting", "infidelity_jealousy", "love_bombing_cycle", "parenting_conflicts", "self_doubt_recovery"], "primary_label": "control_and_gaslighting", "label_scores": {"parenting_conflicts": 1, "self_doubt_recovery": 1, "control_and_gaslighting": 1, "infidelity_jealousy": 1, "love_bombing_cycle": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5hz5/i_had_a_dream_about_my_nex_last_night_and_i_feel/nltmosc/"}
{"text": "What happened during this trip in LV with her? Did she do something that seeded doubt in you about her mental stability? Some events that led to question yourself about what you want in your life? Dreams are strange. A few weeks after moving in with my ex partner, I had this dream in where there were him, his 2 kids and a baby girl he was hiding from me and who he left under the care of his ex wife, as he was not much interested in baby. This was weird. A few weeks after I moved out (after 4 years under the same roof), I had this dream in where he was there with his 2 grown kids, and a little girl near him, all joyful and smiling. Then she left him very happy. I woke up feeling pretty good. I made the link with the previous dream. This baby girl was me: I had grown up from this relationship from a neglected baby to a joyful little girl. (Still need to grow to adulthood but probably with another partner!) Dreams are weird but so meaningful for our subconscious.", "labels": ["parenting_conflicts"], "primary_label": "parenting_conflicts", "label_scores": {"parenting_conflicts": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi5hz5/i_had_a_dream_about_my_nex_last_night_and_i_feel/nlv0p8k/"}
{"text": "How did you power through love bombing? I told my wife I wanted a trial separation. Her mom is here visiting for a few weeks and my dad suggested waiting to tell our daughter and mind or until after my MIL leaves, because she seems likely to say inappropriate things to our daughter while she's here. In the meantime, my wife is love-bombing and future faking. I know it's manipulation, but after my MIL leaves next weekend I'm going to have to initiate this damn separation conversation a FOURTH time to get it rolling, and then we have to break it to our daughter. It feels impossible, and doubly so after being treated like a human for two whole weeks 🤦. It's like those dreams where you're trying to run as fast as you can, but the air is thick like honey and resists every movement.", "labels": ["communication_breakdown", "love_bombing_cycle"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1, "love_bombing_cycle": 1}, "kind": "post", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi2xgu/how_did_you_power_through_love_bombing/"}
{"text": "Mine did that at the end too. I managed my own expectations and viewed it as an end cap to our marriage. It’s hurtful to hear future faking and see them be nice but I hadn’t seen the nice version in years. I selfishly let myself enjoy it, knowing it was over. Radical acceptance. I know they make it impossible to break through their delusions and ground them in reality. It’s a set up. She wants you to look like the bad guy and needs to be able to blame you. Accept it as the price of freedom. I let it go with mine. He can have his narrative, it is safer to let them. It won’t be accurate and they will cast themselves as the victim. It’s manipulation centered around how they want to feel or be seen. You have to not care.", "labels": ["control_and_gaslighting", "emotional_abuse", "communication_breakdown"], "primary_label": "control_and_gaslighting", "label_scores": {}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi2xgu/how_did_you_power_through_love_bombing/nltzvfq/"}
{"text": "Do NOTHING. You don't have to 'power through'. This isn't about force, it's about removal of force. You have already left the relationship emotionally, all you have to deal with now are the practical matters. So, don't talk about your feelings to her. That's it. That's the whole story. She says 'I love you so much, I want us to work on our future together', you say 'Yes, I know that's how you feel.' Don't agree or disagree, just allow her to express what she wants to. When she realises you're not responding in the way she planned, she will change tack quickly, and it will be much easier to hold your resolve once she goes back to treating you as subhuman. This isn't about what you do. It's about what you *don't* do.", "labels": ["communication_breakdown"], "primary_label": "communication_breakdown", "label_scores": {"communication_breakdown": 1}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi2xgu/how_did_you_power_through_love_bombing/nlsqrai/"}
{"text": "It's so hard. I think just reminding yourself it doesn't last. Screen shotting the bad moments. Reminding myself who he truly is. It's such a mindfuck the rollercoaster they put us through. I'm a year out, he gave up love bombing because I caught him cheating with men while I was pregnant, so now he's just an evil monster 24/7. It's hard reality realizing the love bombing will one day stop for good and their true colors will be left", "labels": ["love_bombing_cycle"], "primary_label": "love_bombing_cycle", "label_scores": {"love_bombing_cycle": 2}, "kind": "comment", "source_permalink": "https://www.reddit.com/r/NarcissisticSpouses/comments/1oi2xgu/how_did_you_power_through_love_bombing/nlvayh5/"}
